@extends('layouts.master')

@section('content')

<!--start: block header -->
<div class="block-header">
  <div>
    <div></div>
    <div></div>
  </div>
  <h1 class="mr-3 ml-3 txt-blue">ثبت پیچ</h1>
  <div></div>
</div>
<!--End: block header -->
<!-- Start: block Breadcrumbs -->
<!-- SECTION: steps are here -->
<div class="block-breadcrumb">
  <!-- REVIEW: Romove "doing" class and add "done" when it's done  -->
  <div class="breadcrumb-item doing active" id="link-1" onclick="handlePrev({id: 1})">
    <div class="step">
      <svg width="38" height="42" viewBox="0 0 38 42" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M28.9014 13.9735C28.4484 13.9735 28.0811 13.6061 28.0811 13.1532V7.54395C28.0811 7.09097 28.4484 6.72363 28.9014 6.72363C29.3543 6.72363 29.7217 7.09097 29.7217 7.54395V13.1532C29.7217 13.6061 29.3544 13.9735 28.9014 13.9735Z" fill="#BEA254"></path>
        <path d="M28.8965 5.72461C29.3495 5.72461 29.7168 5.35734 29.7168 4.9043C29.7168 4.45125 29.3495 4.08398 28.8965 4.08398C28.4434 4.08398 28.0762 4.45125 28.0762 4.9043C28.0762 5.35734 28.4434 5.72461 28.8965 5.72461Z" fill="#BEA254"></path>
        <path d="M37.5126 8.61796C37.5126 3.86597 33.6473 0 28.8962 0C26.9297 0 25.115 0.66232 23.6632 1.77565H2.98536C1.33924 1.77565 0 3.11481 0 4.76101V34.6018C0 36.2479 1.33924 37.5872 2.98536 37.5872H5.5883V39.0146C5.5883 40.6607 6.92754 42 8.57366 42H30.0216C31.6678 42 33.007 40.6608 33.007 39.0146V27.6367C33.007 27.1837 32.6397 26.8163 32.1867 26.8163C31.7337 26.8163 31.3664 27.1837 31.3664 27.6367V39.0146C31.3664 39.756 30.7631 40.3594 30.0216 40.3594H8.57366C7.83218 40.3594 7.22892 39.7561 7.22892 39.0146V37.5872H24.4334C26.0795 37.5872 27.4189 36.248 27.4189 34.6018V17.1091C27.8991 17.1924 28.3927 17.2359 28.8963 17.2359C29.7545 17.2359 30.5837 17.1097 31.3665 16.8751V20.2201C31.3665 20.6731 31.7338 21.0404 32.1868 21.0404C32.6397 21.0404 33.0071 20.6731 33.0071 20.2201V16.1903C35.6888 14.7281 37.5126 11.8821 37.5126 8.61796ZM25.7782 34.6018C25.7782 35.3433 25.175 35.9467 24.4334 35.9467H2.98536C2.24388 35.9467 1.64062 35.3434 1.64062 34.6018V4.76101C1.64062 4.01953 2.24388 3.41627 2.98536 3.41627H22.0306C21.001 4.7725 20.3633 6.44183 20.2876 8.25398H6.31846C5.86548 8.25398 5.49814 8.62132 5.49814 9.0743V12.5388C5.49814 12.9918 5.86548 13.3591 6.31846 13.3591H21.1003C21.2868 13.3591 21.4587 13.2969 21.5965 13.192C22.5765 14.7509 24.0416 15.9754 25.7782 16.652V34.6018ZM20.28 9.89461V11.7185H7.13877V9.89461H20.28ZM28.8962 15.5952C25.0499 15.5952 21.9206 12.4652 21.9206 8.61788C21.9206 4.77061 25.0499 1.64054 28.8962 1.64054C32.7427 1.64054 35.8719 4.77053 35.8719 8.61788C35.8719 12.4652 32.7427 15.5952 28.8962 15.5952Z" fill="#BEA254"></path>
        <path d="M32.1857 24.7336C31.8477 24.7336 31.5379 24.5173 31.4188 24.2019C31.2965 23.8782 31.3966 23.4976 31.6656 23.2786C31.9351 23.0594 32.323 23.033 32.6186 23.2165C32.9136 23.3996 33.0646 23.7607 32.9848 24.0995C32.8984 24.4658 32.5626 24.7336 32.1857 24.7336Z" fill="#BEA254"></path>
        <path d="M21.1022 17.8535H6.32031C5.86734 17.8535 5.5 17.4863 5.5 17.0332C5.5 16.5802 5.86734 16.2129 6.32031 16.2129H21.1022C21.5552 16.2129 21.9225 16.5802 21.9225 17.0332C21.9225 17.4862 21.5552 17.8535 21.1022 17.8535Z" fill="#BEA254"></path>
        <path d="M21.0993 21.7437H6.31738C5.86441 21.7437 5.49707 21.3763 5.49707 20.9233C5.49707 20.4703 5.86441 20.103 6.31738 20.103H21.0993C21.5522 20.103 21.9196 20.4703 21.9196 20.9233C21.9196 21.3763 21.5523 21.7437 21.0993 21.7437Z" fill="#BEA254"></path>
        <path d="M21.0993 25.6338H6.31738C5.86441 25.6338 5.49707 25.2665 5.49707 24.8135C5.49707 24.3605 5.86441 23.9932 6.31738 23.9932H21.0993C21.5522 23.9932 21.9196 24.3605 21.9196 24.8135C21.9196 25.2665 21.5523 25.6338 21.0993 25.6338Z" fill="#BEA254"></path>
        <path d="M21.0993 29.5254H6.31738C5.86441 29.5254 5.49707 29.1581 5.49707 28.7051C5.49707 28.252 5.86441 27.8848 6.31738 27.8848H21.0993C21.5522 27.8848 21.9196 28.252 21.9196 28.7051C21.9196 29.1581 21.5523 29.5254 21.0993 29.5254Z" fill="#BEA254"></path>
      </svg>
    </div>
    <p class="breadcrumb-txt">معرفی اثر و شخصیت</p>
  </div>
  <div class="undone" id="link-line-1">
    <svg width="60" height="30" viewBox="0 0 60 30" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path d="M58 17C59.1046 17 60 16.1046 60 15C60 13.8954 59.1046 13 58 13V17ZM0.585786 13.5858C-0.195262 14.3668 -0.195262 15.6332 0.585786 16.4142L13.3137 29.1421C14.0948 29.9232 15.3611 29.9232 16.1421 29.1421C16.9232 28.3611 16.9232 27.0948 16.1421 26.3137L4.82843 15L16.1421 3.68629C16.9232 2.90524 16.9232 1.63891 16.1421 0.857864C15.3611 0.0768156 14.0948 0.0768156 13.3137 0.857864L0.585786 13.5858ZM58 13H2V17H58V13Z" fill="#C4C4C4"></path>
    </svg>
  </div>
  <div class="breadcrumb-item undone" id="link-2" onclick="handlePrev({id: 2})">
    <div class="step undone">
      <svg width="51" height="26" viewBox="0 0 51 26" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M16.2734 22.482C16.2734 19.2645 18.5365 16.5239 21.6122 16.0169L21.8892 15.9712C24.352 15.5652 26.8615 15.5652 29.3243 15.9712L29.6014 16.0169C32.677 16.5239 34.9401 19.2645 34.9401 22.482C34.9401 23.8726 33.8488 25 32.5026 25H18.7109C17.3647 25 16.2734 23.8726 16.2734 22.482Z" stroke="#999999" stroke-width="1.5"></path>
        <path d="M31.0512 6.25C31.0512 9.1495 28.6137 11.5 25.6068 11.5C22.5999 11.5 20.1624 9.1495 20.1624 6.25C20.1624 3.35051 22.5999 1 25.6068 1C28.6137 1 31.0512 3.35051 31.0512 6.25Z" stroke="#999999" stroke-width="1.5"></path>
        <path d="M34.8184 20.7578C34.8184 18.1253 36.67 15.883 39.1864 15.4682L39.4131 15.4308C41.4281 15.0986 43.4814 15.0986 45.4964 15.4308L45.723 15.4682C48.2395 15.883 50.0911 18.1253 50.0911 20.7578C50.0911 21.8956 49.1982 22.818 48.0968 22.818H36.8127C35.7112 22.818 34.8184 21.8956 34.8184 20.7578Z" stroke="#999999" stroke-width="1.5"></path>
        <path d="M46.9093 7.4771C46.9093 9.84941 44.9149 11.7725 42.4547 11.7725C39.9946 11.7725 38.0002 9.84941 38.0002 7.4771C38.0002 5.10478 39.9946 3.18164 42.4547 3.18164C44.9149 3.18164 46.9093 5.10478 46.9093 7.4771Z" stroke="#999999" stroke-width="1.5"></path>
        <path d="M1 20.7578C1 18.1253 2.85163 15.883 5.36805 15.4682L5.59471 15.4308C7.60973 15.0986 9.663 15.0986 11.678 15.4308L11.9047 15.4682C14.4211 15.883 16.2727 18.1253 16.2727 20.7578C16.2727 21.8956 15.3798 22.818 14.2784 22.818H2.99432C1.89289 22.818 1 21.8956 1 20.7578Z" stroke="#999999" stroke-width="1.5"></path>
        <path d="M13.0909 7.4771C13.0909 9.84941 11.0966 11.7725 8.63639 11.7725C6.17621 11.7725 4.18184 9.84941 4.18184 7.4771C4.18184 5.10478 6.17621 3.18164 8.63639 3.18164C11.0966 3.18164 13.0909 5.10478 13.0909 7.4771Z" stroke="#999999" stroke-width="1.5"></path>
      </svg>
    </div>
    <p class="breadcrumb-txt">معرفی تیم</p>
  </div>
  <div class="undone" id="link-line-2">
    <svg width="60" height="30" viewBox="0 0 60 30" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path d="M58 17C59.1046 17 60 16.1046 60 15C60 13.8954 59.1046 13 58 13V17ZM0.585786 13.5858C-0.195262 14.3668 -0.195262 15.6332 0.585786 16.4142L13.3137 29.1421C14.0948 29.9232 15.3611 29.9232 16.1421 29.1421C16.9232 28.3611 16.9232 27.0948 16.1421 26.3137L4.82843 15L16.1421 3.68629C16.9232 2.90524 16.9232 1.63891 16.1421 0.857864C15.3611 0.0768156 14.0948 0.0768156 13.3137 0.857864L0.585786 13.5858ZM58 13H2V17H58V13Z" fill="#C4C4C4"></path>
    </svg>
  </div>
  <div class="breadcrumb-item undone" id="link-3" onclick="handlePrev({id: 3})">
    <div class="step">
      <svg width="43" height="42" viewBox="0 0 43 42" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M19.8686 31.1217C19.5514 30.8889 19.1051 30.9568 18.872 31.2742L18.7839 31.394C18.5511 31.7111 18.6189 32.1568 18.9356 32.3901C19.0629 32.484 19.2111 32.5293 19.358 32.5293C19.5765 32.5293 19.7922 32.4291 19.9319 32.2398L20.0213 32.1183C20.2543 31.801 20.1859 31.3547 19.8686 31.1217Z" fill="#999999"></path>
        <path d="M20.0548 37.9026L18.2212 34.5684L19.9332 32.2366C20.1663 31.9193 20.0979 31.473 19.7805 31.24C19.4631 31.0068 19.0169 31.0752 18.7839 31.3927L16.8024 34.0914C16.6381 34.3151 16.6186 34.6137 16.7523 34.857L18.8055 38.5898V38.5897C18.9353 38.8257 19.1792 38.9592 19.4308 38.9592C19.5471 38.9591 19.6648 38.9307 19.7738 38.8708C20.1187 38.6811 20.2446 38.2476 20.0548 37.9026Z" fill="#999999"></path>
        <path d="M25.3676 34.0934L23.3942 31.4057C23.2305 31.1829 22.9532 31.0746 22.6819 31.1283C22.4107 31.1816 22.1948 31.387 22.1278 31.6551C22.0763 31.861 22.1192 32.079 22.2448 32.25L23.9484 34.5704L22.1273 37.882C22.0695 37.9872 22.0391 38.1058 22.0391 38.2259C22.0391 38.5514 22.2595 38.8355 22.5747 38.9165C22.6337 38.9317 22.6933 38.939 22.7521 38.939C23.0073 38.939 23.2492 38.8013 23.3768 38.5696L25.4176 34.8592C25.5515 34.6158 25.5319 34.3171 25.3676 34.0934Z" fill="#999999"></path>
        <path d="M26.4992 22.8894C26.2647 22.7663 25.9812 22.7831 25.7631 22.9335C25.339 23.2256 24.9454 23.5352 24.5934 23.8533C22.6747 25.5879 20.8517 25.3532 20.7803 25.343C20.7373 25.3362 20.6936 25.3331 20.6503 25.3345C19.892 25.3539 18.5248 24.661 17.0784 23.525C16.8571 23.3513 16.6303 23.1858 16.4038 23.0329C16.1854 22.8853 15.9031 22.8704 15.6704 22.9942C15.4375 23.1179 15.292 23.3601 15.292 23.6238V26.0697C15.292 26.2859 15.3904 26.4904 15.5591 26.6258C15.579 26.6418 15.5998 26.6567 15.6212 26.6703L20.6768 30.0486C20.6776 30.0491 20.6783 30.0497 20.6792 30.0503L20.6925 30.0592C20.8115 30.1379 20.9487 30.1777 21.0863 30.1777C21.2021 30.1777 21.3179 30.1496 21.4237 30.093C21.446 30.0811 21.4675 30.068 21.4881 30.054C21.4904 30.0524 21.4928 30.0509 21.4953 30.0492C21.4981 30.0474 21.5009 30.0455 21.5037 30.0436L26.5473 26.6734C26.5676 26.6605 26.5874 26.6467 26.6064 26.6319C26.7794 26.4968 26.8806 26.2895 26.8806 26.0699V23.5207C26.8806 23.2556 26.7338 23.0127 26.4992 22.8894ZM25.4545 25.6883L21.0862 28.6073L16.718 25.6882V25.0398C17.7816 25.8128 19.3463 26.7609 20.6217 26.7608C20.6243 26.7608 20.6273 26.7608 20.63 26.7608C21.0582 26.8081 23.2419 26.9369 25.4547 24.9957V25.6883H25.4545Z" fill="#999999"></path>
        <path d="M21.7885 29.3462C21.7415 29.0635 21.5296 28.8364 21.2507 28.7698C20.9716 28.7037 20.6802 28.8104 20.5105 29.0415L18.8718 31.2736C18.6387 31.591 18.707 32.0373 19.0245 32.2703C19.1516 32.3637 19.2994 32.4087 19.4459 32.4087C19.6652 32.4087 19.8815 32.3078 20.0213 32.1174L21.6515 29.8971C21.7443 29.7758 21.7983 29.6249 21.7983 29.4637C21.7982 29.4245 21.7949 29.3849 21.7885 29.3462Z" fill="#999999"></path>
        <path d="M31.9465 6.36112C31.9324 6.24943 31.5984 3.83897 29.3294 2.88808C29.3953 2.46473 29.3884 1.92064 29.1196 1.39129C28.7584 0.67983 28.0455 0.216205 27.0008 0.0130958C26.9559 0.00436528 26.9105 0 26.8648 0H17.2952C13.4094 0 10.248 3.16128 10.248 7.04721V10.8023C10.248 11.7806 10.5815 12.7346 11.1869 13.4884C11.487 13.8621 11.8567 14.5149 11.9125 15.5018C11.9342 15.8871 12.2567 16.1848 12.6444 16.1741C13.0302 16.1632 13.3373 15.8473 13.3373 15.4614V10.5657C13.8214 8.56352 15.4737 8.17386 15.7578 8.12123H18.8532C19.2173 8.12123 19.5753 8.06563 19.9176 7.95593C20.5061 7.76715 21.4399 7.41974 22.1197 7.16153C22.5745 6.98865 23.0781 6.9823 23.5374 7.14374L26.8513 8.30704C28.5079 8.91818 28.8036 10.3726 28.8403 10.601V16.4766C28.8403 16.8498 29.128 17.1594 29.5001 17.1872C29.5182 17.1885 29.536 17.1892 29.5538 17.1892C29.9035 17.1891 30.2054 16.9329 30.2584 16.5818C30.2612 16.5634 30.5458 14.7245 31.4639 13.2522C31.7833 12.7396 31.9522 12.1552 31.9522 11.5622V6.45114C31.9522 6.42108 31.9503 6.39101 31.9465 6.36112ZM30.5262 11.5619C30.5262 11.8804 30.4363 12.1963 30.2661 12.4773V10.5523C30.2661 10.5265 30.2647 10.5009 30.2619 10.4753C30.2507 10.3717 29.9561 7.92833 27.3382 6.96665C27.335 6.9655 27.3318 6.96435 27.3286 6.9632L24.0097 5.79808C23.6355 5.66671 23.2441 5.60115 22.8528 5.60115C22.4321 5.60115 22.0116 5.677 21.6133 5.82855C20.6615 6.19013 19.9244 6.45625 19.482 6.59808C19.2808 6.66257 19.0692 6.69535 18.8531 6.69535H15.7001C15.6696 6.69535 15.6389 6.69733 15.6085 6.7012C15.4879 6.71685 12.6441 7.12125 11.9284 10.3289C11.9171 10.3799 11.9113 10.4319 11.9113 10.4842V11.9516C11.756 11.5928 11.6738 11.2009 11.6738 10.8023V7.04737C11.6738 3.94786 14.1956 1.42613 17.295 1.42613H26.7928C27.186 1.50989 27.6639 1.68179 27.8451 2.0315C28.0671 2.45955 27.8143 3.04894 27.814 3.04943C27.7228 3.2434 27.7239 3.46801 27.8166 3.66115C27.9093 3.85429 28.0841 3.99547 28.2925 4.04562C30.1076 4.48256 30.4778 6.22349 30.5261 6.50509V11.5619H30.5262Z" fill="#999999"></path>
        <path d="M30.2648 10.4756C30.2536 10.3721 29.959 7.9287 27.341 6.96702C27.3378 6.96587 27.3346 6.96472 27.3314 6.96356L24.0126 5.79845C23.2359 5.52582 22.3849 5.53669 21.616 5.82876C20.6642 6.19033 19.9271 6.45645 19.4848 6.59836C19.2836 6.66285 19.072 6.69555 18.8558 6.69555H15.7029C15.6723 6.69555 15.6417 6.69753 15.6113 6.7014C15.4906 6.71705 12.6469 7.12146 11.9312 10.3291C11.9198 10.3801 11.9141 10.4321 11.9141 10.4844V16.6135C11.9141 16.6188 11.9141 16.6241 11.9142 16.6294C11.9189 16.8423 12.0696 21.8703 15.5437 24.1698L15.5616 24.1825C15.5765 24.1931 15.5914 24.2036 15.607 24.2141C15.8051 24.3478 16.004 24.493 16.1985 24.6457C17.2106 25.4405 19.1179 26.76 20.6225 26.76C20.6253 26.76 20.628 26.76 20.6309 26.76C20.7126 26.769 20.8584 26.781 21.0563 26.781C21.909 26.781 23.7282 26.5576 25.5505 24.9103C25.8563 24.634 26.2001 24.3636 26.5729 24.1068L26.6262 24.0695C26.6436 24.0573 26.661 24.0449 26.6789 24.0329C27.8378 23.2545 29.8448 21.2462 30.2662 16.5404C30.2681 16.5193 30.2691 16.498 30.2691 16.4767V10.5526C30.269 10.5269 30.2675 10.5013 30.2648 10.4756ZM28.8429 16.4445C28.4544 20.6914 26.645 22.3377 25.8838 22.849C25.8568 22.8672 25.8301 22.886 25.8034 22.9047L25.7639 22.9326C25.3398 23.2247 24.9462 23.5342 24.5942 23.8524C22.6826 25.5806 20.8656 25.3539 20.7765 25.3414C20.7351 25.3352 20.693 25.3326 20.6511 25.3337C19.8928 25.3532 18.5256 24.6602 17.0792 23.5243C16.8579 23.3505 16.6311 23.1849 16.4049 23.0323L16.3874 23.02C16.3703 23.0078 16.3532 22.9957 16.3331 22.9823C13.5296 21.1268 13.3462 16.7845 13.34 16.6033V10.566C13.8259 8.55648 15.4884 8.17126 15.7594 8.12152H18.8559C19.2201 8.12152 19.5781 8.06592 19.9203 7.95621C20.5089 7.76743 21.4427 7.42002 22.1225 7.16181C22.5773 6.98893 23.0809 6.98259 23.5402 7.14402L26.854 8.30733C28.5107 8.91847 28.8064 10.3728 28.843 10.6013V16.4445H28.8429Z" fill="#999999"></path>
        <path d="M21.7227 29.1455C21.6116 28.9233 21.3929 28.775 21.1454 28.7539C20.8983 28.7335 20.6573 28.8421 20.5103 29.0424L18.8024 31.3685C18.5695 31.6858 18.6376 32.1317 18.9546 32.3649C19.0818 32.4585 19.2298 32.5037 19.3765 32.5037C19.5952 32.5037 19.8112 32.4033 19.9509 32.2136L21.6589 29.896C21.7493 29.7735 21.798 29.6168 21.798 29.4646C21.7981 29.354 21.7722 29.2446 21.7227 29.1455Z" fill="#999999"></path>
        <path d="M21.7691 40.6245C21.5013 40.3444 21.0587 40.3295 20.7728 40.5912L20.6098 40.7403C20.3657 40.9634 20.3072 41.3251 20.4684 41.6139L20.4735 41.6229C20.5823 41.818 20.7766 41.9508 20.9979 41.9815C21.0306 41.986 21.0634 41.9882 21.096 41.9882C21.2838 41.9882 21.4655 41.914 21.6002 41.7794L21.7581 41.6213C22.0321 41.3473 22.037 40.9045 21.7691 40.6245Z" fill="#999999"></path>
        <path d="M21.5613 40.7402L21.3983 40.5911C21.1123 40.3295 20.6697 40.3445 20.4018 40.6245C20.1339 40.9047 20.1389 41.3476 20.413 41.6215L20.5711 41.7796C20.7058 41.9142 20.8875 41.9883 21.0752 41.9883C21.1087 41.9883 21.1424 41.986 21.1761 41.9812C21.3981 41.9495 21.5923 41.815 21.7003 41.6183L21.7053 41.6093C21.8633 41.321 21.8038 40.962 21.5613 40.7402Z" fill="#999999"></path>
        <path d="M21.5728 40.7507L21.5719 40.7499C21.4618 40.6469 21.3193 40.5791 21.1624 40.5618C20.9523 40.5389 20.7477 40.6101 20.5988 40.7487L20.5967 40.7507C20.4526 40.8822 20.3686 41.0671 20.3644 41.2621C20.3602 41.4573 20.4362 41.6455 20.5745 41.7831L20.5819 41.7905C20.7211 41.9288 20.9028 41.9979 21.0847 41.9979C21.2672 41.9979 21.4496 41.9283 21.5888 41.7892L21.5963 41.7817C21.734 41.6439 21.8094 41.4559 21.8049 41.2612C21.8006 41.0664 21.7167 40.882 21.5728 40.7507Z" fill="#999999"></path>
        <path d="M21.3171 28.7734C21.0219 28.6788 20.6978 28.7885 20.518 29.0413C20.3169 29.3245 20.3501 29.7104 20.5951 29.9565C20.733 30.0951 20.916 30.1661 21.1004 30.1661C21.2437 30.1661 21.3876 30.1232 21.5118 30.0358C21.7016 29.9023 21.8145 29.6848 21.8145 29.4527V29.451C21.8145 29.1407 21.6127 28.8677 21.3171 28.7734Z" fill="#999999"></path>
        <path d="M21.6644 29.0352L21.6583 29.0269C21.4754 28.7793 21.1542 28.6774 20.8619 28.7737C20.5696 28.8699 20.3721 29.1431 20.3721 29.4508V29.463C20.3721 29.7255 20.5194 29.9647 20.7507 30.0889C20.8555 30.1452 20.9711 30.1729 21.0866 30.1729C21.2259 30.1729 21.365 30.1326 21.4846 30.0533C21.6476 29.9454 21.7592 29.7753 21.7932 29.5828C21.8272 29.3904 21.7807 29.1923 21.6644 29.0352Z" fill="#999999"></path>
        <path d="M29.5677 26.7965C29.4938 26.6012 29.3381 26.4482 29.1416 26.3779L26.4078 25.3979C26.3857 25.39 26.3627 25.3829 26.3398 25.3773C26.1447 25.3285 25.9379 25.3643 25.7707 25.4761L20.7055 28.8608C20.7042 28.8617 20.7027 28.8626 20.7013 28.8636L21.0991 29.455L20.6924 28.8696C20.5439 28.9679 20.4374 29.1185 20.3943 29.2913C20.3706 29.3862 20.3667 29.4853 20.3828 29.5817C20.4011 29.6919 20.4451 29.7964 20.5113 29.8866L24.2198 34.9372C24.3545 35.1208 24.5683 35.2283 24.7943 35.2283C24.8098 35.2283 24.8254 35.2277 24.8409 35.2266C25.0838 35.2106 25.3018 35.0721 25.4191 34.8587L29.5255 27.3926C29.6263 27.2096 29.6417 26.9916 29.5677 26.7965ZM24.708 33.1928L22.1016 29.6429L26.2644 26.8612L27.8732 27.438L24.708 33.1928Z" fill="#999999"></path>
        <path d="M21.7869 29.3411C21.7534 29.1497 21.6433 28.9803 21.4819 28.872L16.3998 25.4761C16.238 25.3678 16.0386 25.3308 15.8486 25.3729C15.8194 25.3794 15.7908 25.3878 15.7627 25.3978L13.029 26.3778C12.8324 26.4482 12.6767 26.6012 12.6028 26.7964C12.5289 26.9917 12.5443 27.2095 12.6449 27.3925L16.7513 34.8586C16.8686 35.0719 17.0866 35.2106 17.3295 35.2265C17.345 35.2275 17.3606 35.228 17.376 35.228C17.602 35.228 17.8158 35.1206 17.9508 34.9369L19.9323 32.2382C19.9338 32.2362 19.9354 32.2339 19.937 32.2317L21.6593 29.8859C21.7743 29.7292 21.8204 29.5326 21.7869 29.3411ZM18.783 31.394C18.7812 31.3963 18.7796 31.3986 18.7779 31.4009L17.4623 33.1927L14.297 27.4379L15.9059 26.8612L20.0687 29.6428L18.783 31.394Z" fill="#999999"></path>
        <path d="M42.1345 38.9688L41.2148 33.4148C40.9249 31.6645 39.7085 30.2021 38.0401 29.5987L29.1421 26.3795C28.8677 26.2803 28.5611 26.358 28.3672 26.5756C28.1733 26.7933 28.1314 27.1071 28.2615 27.3682L30.1193 31.0938L28.2963 31.1219C28.0488 31.1258 27.8209 31.2575 27.6945 31.4704C27.568 31.6832 27.5609 31.9463 27.6757 32.1656L28.4234 33.5932L20.7716 40.5931C20.7638 40.6002 20.7561 40.6075 20.7486 40.615L20.5906 40.7729C20.3669 40.9968 20.3174 41.3414 20.4693 41.6191L20.4749 41.6293C20.6 41.8578 20.8399 42.0001 21.1005 42.0001H39.564C40.3311 42.0001 41.0554 41.6646 41.5513 41.0797C42.0473 40.4947 42.2599 39.7253 42.1345 38.9688ZM40.4639 40.1574C40.2393 40.4223 39.9113 40.5742 39.5641 40.5742H22.9047L29.7912 34.2747C30.0301 34.0563 30.0919 33.7046 29.9416 33.4179L29.4765 32.5297L31.2741 32.5021C31.5192 32.4983 31.7449 32.3689 31.8723 32.1597C31.9996 31.9502 32.0105 31.6903 31.9012 31.4709L30.3333 28.3266L37.5554 30.9394C38.7394 31.3677 39.6027 32.4055 39.8083 33.6476L40.7281 39.2017C40.7281 39.2018 40.7281 39.2018 40.7281 39.2018C40.7847 39.5443 40.6885 39.8925 40.4639 40.1574Z" fill="#999999"></path>
        <path d="M21.5792 40.7583L21.5709 40.7508C21.2887 40.4953 20.8553 40.5067 20.5868 40.7766L20.5794 40.7841C20.3764 40.9884 20.3162 41.2948 20.4267 41.5607C20.5373 41.8266 20.7971 41.9998 21.0851 41.9998H21.1007C21.3955 41.9998 21.66 41.8183 21.7659 41.5433C21.872 41.2681 21.7978 40.9561 21.5792 40.7583Z" fill="#999999"></path>
        <path d="M21.5563 40.7367C21.3944 40.591 21.1749 40.5272 20.9599 40.5639C20.7452 40.6002 20.5589 40.7329 20.4541 40.9238L20.4492 40.9328C20.2989 41.2068 20.3446 41.5468 20.562 41.7715L20.5645 41.7741C20.7042 41.9185 20.8903 41.9913 21.077 41.9913C21.2487 41.9913 21.4209 41.9295 21.5573 41.8049L21.5648 41.7982C21.6296 41.7392 21.6829 41.6685 21.7221 41.5901C21.8657 41.3032 21.7947 40.9512 21.5563 40.7367Z" fill="#999999"></path>
        <path d="M21.5877 40.7817L21.5848 40.7786C21.5829 40.7767 21.5809 40.7747 21.5791 40.7729L21.4209 40.615C21.4135 40.6075 21.4059 40.6001 21.3981 40.5931L13.7463 33.5933L14.4941 32.1657C14.609 31.9464 14.6018 31.6833 14.4754 31.4704C14.3489 31.2577 14.121 31.1258 13.8735 31.122L12.0504 31.0939L13.9082 27.3682C14.0383 27.1073 13.9963 26.7934 13.8025 26.5757C13.6087 26.358 13.3017 26.2802 13.0277 26.3795L4.12965 29.5988C2.46129 30.2021 1.24478 31.6645 0.954942 33.4149L0.0351858 38.9689C-0.0900894 39.7257 0.122574 40.495 0.618568 41.0798C1.11465 41.6647 1.83903 42.0002 2.60584 42.0002H21.0851C21.3739 42.0002 21.6341 41.826 21.7441 41.5591C21.8543 41.2922 21.7925 40.9852 21.5877 40.7817ZM2.60592 40.5743C2.25868 40.5743 1.93071 40.4224 1.70618 40.1575C1.48166 39.8927 1.38546 39.5444 1.44212 39.2018L2.36188 33.6477C2.56754 32.4054 3.4308 31.3678 4.61478 30.9395L11.8368 28.3267L10.269 31.4709C10.1596 31.6902 10.1705 31.9501 10.2979 32.1596C10.4251 32.369 10.6511 32.4983 10.8961 32.502L12.6938 32.5297L12.2286 33.4179C12.0784 33.7045 12.1402 34.0563 12.3789 34.2747L19.2654 40.5743H2.60592Z" fill="#999999"></path>
        <path d="M23.5112 31.9997C23.5627 31.7938 23.5198 31.5757 23.3942 31.4047L21.6591 29.0417C21.4768 28.7933 21.1552 28.6946 20.8625 28.7906C20.7044 28.8424 20.5742 28.947 20.4876 29.0807L18.7842 31.3919C18.7598 31.4249 18.7382 31.4603 18.7198 31.497C18.6031 31.7305 18.6233 32.0091 18.7723 32.2233L19.4977 33.2649L18.725 38.1357C18.7002 38.2921 18.7282 38.4522 18.8045 38.591L20.4598 41.6006C20.5851 41.8285 20.8246 41.97 21.0845 41.97C21.3446 41.97 21.584 41.8285 21.7093 41.6006L23.377 38.5687C23.4348 38.4634 23.4652 38.3452 23.4652 38.2251V38.2247C23.4652 38.1873 23.4621 38.1499 23.4564 38.113L22.6872 33.265L23.4047 32.2348C23.454 32.1635 23.4903 32.0837 23.5112 31.9997ZM21.0845 39.7777L20.1715 38.1178L20.951 33.2049C20.9799 33.0229 20.9372 32.8369 20.8319 32.6858L20.2345 31.8277L21.0866 30.6715L21.9432 31.8381L21.3529 32.6858C21.2476 32.8368 21.205 33.0229 21.2338 33.2049L22.0097 38.0954L21.0845 39.7777Z" fill="#999999"></path>
      </svg>
    </div>
    <p class="breadcrumb-txt">معرفی شخصیت ها</p>
  </div>
  <div class="undone" id="link-line-3">
    <svg width="60" height="30" viewBox="0 0 60 30" fill="none" xmlns="http://www.w3.org/2000/svg">
      <path d="M58 17C59.1046 17 60 16.1046 60 15C60 13.8954 59.1046 13 58 13V17ZM0.585786 13.5858C-0.195262 14.3668 -0.195262 15.6332 0.585786 16.4142L13.3137 29.1421C14.0948 29.9232 15.3611 29.9232 16.1421 29.1421C16.9232 28.3611 16.9232 27.0948 16.1421 26.3137L4.82843 15L16.1421 3.68629C16.9232 2.90524 16.9232 1.63891 16.1421 0.857864C15.3611 0.0768156 14.0948 0.0768156 13.3137 0.857864L0.585786 13.5858ZM58 13H2V17H58V13Z" fill="#C4C4C4"></path>
    </svg>
  </div>
  <div class="breadcrumb-item undone" id="link-4" onclick="handlePrev({id: 4})">
    <div class="step">
      <svg width="46" height="42" viewBox="0 0 46 42" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M36.9547 10.9696C36.4688 8.08239 35.0392 5.44743 32.8528 3.44786C30.4234 1.22404 27.2652 0 23.9762 0C21.4347 0 18.9586 0.728817 16.8375 2.10236C15.0715 3.2423 13.6046 4.78403 12.5674 6.59672C12.1189 6.51263 11.6517 6.46591 11.1845 6.46591C7.21341 6.46591 3.98046 9.69886 3.98046 13.67C3.98046 14.1839 4.03652 14.6791 4.12996 15.165C1.56041 17.0337 0 20.0425 0 23.2474C0 25.8356 0.962411 28.3491 2.71905 30.3393C4.5224 32.3763 6.90507 33.5816 9.44658 33.7218C9.47461 33.7218 9.4933 33.7218 9.52133 33.7218H17.557C18.2578 33.7218 18.8184 33.1611 18.8184 32.4604C18.8184 31.7596 18.2578 31.1989 17.557 31.1989H9.55871C5.73709 30.9653 2.52283 27.3306 2.52283 23.238C2.52283 20.5937 3.94308 18.127 6.23231 16.7908C6.76491 16.4825 6.98916 15.8377 6.7836 15.2584C6.59672 14.7539 6.50328 14.2213 6.50328 13.6513C6.50328 11.0724 8.60564 8.97005 11.1845 8.97005C11.7358 8.97005 12.2778 9.06349 12.7823 9.25036C13.399 9.47461 14.0811 9.1943 14.3614 8.60564C16.1087 4.89615 19.8836 2.50414 23.9855 2.50414C29.4984 2.50414 34.0488 6.6341 34.5721 12.1096C34.6281 12.6795 35.0579 13.1374 35.6186 13.2308C39.7766 13.9409 42.9161 17.7812 42.9161 22.1635C42.9161 26.8074 39.2626 30.8439 34.7589 31.1896H27.8725C27.1718 31.1896 26.6111 31.7502 26.6111 32.451C26.6111 33.1518 27.1718 33.7124 27.8725 33.7124H34.8056C34.8337 33.7124 34.8617 33.7124 34.8991 33.7124C37.7489 33.5069 40.4119 32.1987 42.3928 30.0123C44.3644 27.8445 45.4389 25.0601 45.4389 22.1635C45.4295 16.9216 41.8509 12.2591 36.9547 10.9696Z" fill="#999999"></path>
        <path d="M30.2935 24.4427C30.7887 23.9475 30.7887 23.1533 30.2935 22.6581L23.6127 15.9773C23.3791 15.7437 23.0521 15.6035 22.725 15.6035C22.398 15.6035 22.071 15.7343 21.8374 15.9773L15.1566 22.6581C14.6614 23.1533 14.6614 23.9475 15.1566 24.4427C15.3995 24.6857 15.7265 24.8165 16.0442 24.8165C16.3619 24.8165 16.689 24.695 16.9319 24.4427L21.4636 19.911V40.7383C21.4636 41.4391 22.0243 41.9997 22.725 41.9997C23.4258 41.9997 23.9865 41.4391 23.9865 40.7383V19.911L28.5182 24.4427C29.0041 24.938 29.7983 24.938 30.2935 24.4427Z" fill="#999999"></path>
      </svg>
    </div>
    <p class="breadcrumb-txt">بارگذاری مستندات</p>
  </div>
</div>
<!-- End: block Breadcrumbs -->
<!-- SECTION: End of steps -->
<!-- Start: content -->
<!-- SECTION: Start of Step 1 (معرفی اثر و شخصیت) -->
{!! Form::open(['route' => 'user-pitch.store', 'files' => true]) !!}
<div id="tab-id-1">
  <div class="tab" style="display: block">
    @if ($errors->any())
    <div class="alert alert-danger">
      <ul>
        @foreach ($errors->all() as $error)
        <li>{{ $error }}</li>
        @endforeach
      </ul>
    </div>
    @endif
    <h2 class="txt-blue">معرفی اثر و شخصیت</h2>
    <p>
      در این بخش، جزئیات اطلاعات اثر فرهنگی شخصیت دریافت می‌گردد. منظور از اثر، یعنی محصول فرهنگی که شخصیت طراحی و توسعه داده شده، توانسته در قالب یا فرم این محصول فرهنگی معرفی گردد. شخصیت طراحی و پرداخت شده، ممکن است در قالب محصولات فرهنگی همانند کتاب، پویانمایی، عروسکی، وب سریز، برنامک‌های کاربردی و بازی‌های ویدئویی معرفی شده باشد.
    </p>

    <div class="information-box">
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="name">عنوان اثر (فارسی)</label>
            <input name="title" type="text" class="form-control input-data" id="name" required placeholder="" onchange="handleContinueStepBtn1()" onkeyup="handlePersianInput({id:'name'})" />
            <p id="name-validation" class="d-none error-txt txt-pink">
              فقط حروف فارسی وارد نمایید
            </p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt" for="nameEn">عنوان اثر (انگلیسی)</label>
            <input name="nameEn" type="text" class="form-control input-data" id="nameEn" placeholder="" onchange="handleContinueStepBtn1()" onkeyup="handleEnglishInput({id: 'nameEn'})" />
            <p id="nameEn-validation" class="error-txt txt-pink d-none">فقط حروف انگلیسی وارد نمایید</p>
          </div>
        </div>
      </div>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="yearCreate">سال ساخت/تولید/نشر</label>
            <input name="release" type="text" class="form-control input-data" id="yearCreate" required="" placeholder="مثلا ۱۳۹۹" onchange="handleContinueStepBtn1()" onkeyup="handleCreateYearInput({id: 'yearCreate'})" />
            <p id="yearCreate-validation" class="d-none error-txt txt-pink">فقط عدد وارد نمایید</p>
            <p id="yearCreate-year-validation" class="d-none error-txt txt-pink">لطفا سال ساخت/تولید/نشر را صحیح وارد کنید</p>
          </div>


          <div class="form-group">
            <label class="lbl-txt requier" for="typeOfEffect">نوع اثر</label>
            <select name="type" class="form-control input-data" id="typeOfEffect" onclick="handleTypeofEffects(event)">
              <option value="پویانمایی" selected>
                پویانمایی
              </option>
              <option value="عروسکی">
                عروسکی
              </option>
                                        <option value="نوشت افزار">
                              نوشت افزار
                          </option>
              <option value="وب سریز">
                وب سریز
              </option>
              <option value="کتاب">
                کتاب
              </option>
              <option value="برنامه کاربردی">
                برنامه کاربردی
              </option>
              <option value="بازی های ویدئویی">
                بازی های ویدئویی
              </option>
            </select>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="feature-effect-des">ویژگی‌های اثر</label>
            <textarea name="feature-effect-des" class="form-control input-data" id="feature-effect-des" rows="3" placeholder="" onchange="handleContinueStepBtn1()" onkeyup="handleDescriptionTab({id: 'feature-effect-des', maxlength: 100 })"></textarea>
            <ul id="feature-help-box">
              <li class="note-txt txt-gray d-none" id="bookType">تعیین نوع کتاب شامل کتاب تصویری و رمان کوتاه یا بلند به همراه ژانر تعداد جلدها و تیراژ انتشار</li>
              <li class="note-txt txt-gray" id="animationType">تعیین نوع اثر از نظر سینمایی به همراه مدت زمان و ژانر آن، سریالی یا برنامه تلویزیونی به همراه ژانر، تعداد قسمت و مدت زمان یک قسمت</li>
              <li class="note-txt txt-gray d-none" id="dollyType">تعیین نوع اثر از نظر سینمایی به همراه مدت زمان و ژانر آن، سریالی یا برنامه تلویزیونی به همراه ژانر، تعداد قسمت و مدت زمان یک قسمت</li>
              <li class="note-txt txt-gray d-none" id="webSeriesType">تعیین ژانر به همراه تعداد قسمت ها و مدت زمان هر قسمت</li>
              <li class="note-txt txt-gray d-none" id="practicalAppType">تعیین نوع برنامه کاربردی از نظر کتاب تعاملی، کتاب صوتی، پلتفورم های قصه‌سازی و قصه‌گویی، پلتفورم های کارتون سازی به همراه تعداد دانلودها یا تعداد یوزرهای آن</li>
              <li class="note-txt txt-gray d-none" id="videoGameType">تعیین نوع بازی از نظر پلتفورم های بازی شامل رایانه، موبایلی، کنسول و بروزری به همراه نوع ژانر بازی و تعداد دانلودها و یا یوزرهای آن</li>
            </ul>
            <p id="feature-effect-des-maxlength-validation" class="d-none error-txt txt-pink">تعداد کلمات وارد شده بیش از حد مجاز است</p>
            <p id="feature-effect-des-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <!-- <div class="form-group">
            <label class="lbl-txt requier" for="duration">مدت زمان</label>
            <input name="duration" type="text" class="form-control input-data" id="duration" required placeholder="مثلا یک ساعت و بیست و دو دقیقه و هفت ثانیه" onchange="handleContinueStepBtn1()" onkeyup="handlePersianInput({id: 'duration'})" />
            <p id="duration-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div> -->





          <div class="form-group">
            <label class="lbl-txt requier" for="publishedOn">
              انتشار در
            </label>
            <select name="published_on" class="form-control input-data" id="publishedOn">
              <option value="صدا و سیما" selected>
                صدا و سیما
              </option>
              <option value="نمایش خانگی">
                نمایش خانگی
              </option>
                                        <option value="فروشگاه های لوازم تحریر">
                              فروشگاه های لوازم تحریر
                          </option>
              <option value="پخش آنلاین">
                پخش آنلاین
              </option>
              <option value="شبکه های اجتماعی">
                شبکه های اجتماعی
              </option>
              <option value="اکران سینمایی">
                اکران سینمایی
              </option>
              <option value="استورهای آنلاین">
                استورهای آنلاین
              </option>
              <option value="انتشار در سایت‌">
                انتشار در سایت‌
              </option>
              <option value="فروشگاه‌های کتاب‌">
                فروشگاه‌های کتاب‌
              </option>
              <option value="پلتفورم های کتاب الکترونیکی">
                پلتفورم های کتاب الکترونیکی
              </option>
            </select>
          </div>


          <div class="form-group">
            <label class="lbl-txt requier" for="audiences">
              رده مخاطب اثر
            </label>
            <select name="audience" class="form-control input-data" id="audiences">
              <option value="کودک" selected>
                کودک
              </option>
              <option value="نوجوان">
                نوجوان
              </option>
              <option value="جوان">
                جوان
              </option>
              <option value="همه سنین">
                همه سنین
              </option>
            </select>
          </div>
        </div>
      </div>

    </div>
    {{-- </form> --}}
  </div>

  <div class="row custom">
    <div class="col-12">
      <div class="form-group">
        <label class="lbl-txt requier" for="description">معرفی مختصر اثر</label>
        <textarea name="description" class="form-control input-data" id="description" rows="3" placeholder="" onchange="handleContinueStepBtn1()" onkeyup="handleDescriptionTab({id: 'description', maxlength:500 })"></textarea>
        <div class="note-txt txt-gray">
          <p>در این بخش، به صورت مختصر و حداکثر در 500 کلمه، در خصوص موارد زیر محتوای اثر توضیح داده شود:</p>
          <p>معرفی شخصیت‌های اصلی و چگونگی شکل گیری داستان شخصیت، چگونگی پیشبرد داستان مبتنی بر وصف‌های چهره (پرسونا) شخصیت‌های اصلی و چگونگی ادامه یافتن داستان با حضور شخصیت‌های کمکی.</p>
        </div>
        <p id="description-maxlength-validation" class="d-none error-txt txt-pink">تعداد کلمات وارد شده بیش از حد مجاز است</p>
        <p id="description-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
      </div>
    </div>
  </div>
  <div class="end-box">
    <div id="tab-alert-1" class="alert-box d-none">
      <div class="row justify-content-center">
        <div class="col-md-8">
          <div class="alert fade show" role="alert">
            <span>هشدار!</span><span> پر کردن تمامی کادرهای ستاره&zwnj;دار الزامی است</span>
            <button type="button" class="close" data-dismiss="alert" aria-label="Close">
              <span aria-hidden="true">&times;</span>
            </button>
          </div>
        </div>
      </div>
    </div>
    <div class="btn-box mt-3">
      <button id="stepOneContinueBtn" type="button" class="btn-page btn-txt" onclick="nextStep({
                                  nextStepNumber: 2,
                                  nextTab: 'tab-id-2',
                                  currentTab: 'tab-id-1',
                                  isFinalStep: false,
                                  validation: handleValidationTab1,
                                  })">
        ادامه
      </button>
      <button disabled="" type="submit" class="btn-page btn-txt btn-w-disable">
        برگشت به عقب
      </button>
    </div>
  </div>
</div>
<!-- SECTION: End of Step 1 (معرفی اثر و شخصیت) -->
<!-- SECTION: Start of Step 2 (معرفی تیم) -->
<div class="d-none" id="tab-id-2">
  <h2 class="txt-blue">معرفی تیم</h2>
  <p>
    در این بخش، مجموعه همکاران اصلی که در ساخت، تولید یا نشر اثر همکاری داشته اند به همراه مسئولیت آنها معرفی می‌شوند.
  </p>
  <hr class="hr-seprator" />
  <div class="mt-0 information-box">
    <div class="sec-member">
      <p class="title-txt txt-blue">عضو 1</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="teamMember1">نام و نام خانوادگی</label>
            <input type="text" name="teamName" class="form-control input-data" id="teamMember1" required="" placeholder="" onkeyup="handlePersianInput({id: 'teamMember1'})" onchange="handleContinueStepBtn2()" />
            <p id="teamMember1-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="teamRole1">مسئولیت</label>
            <!-- <input type="text" name="teamRole" class="form-control input-data" id="teamRole1" required="" placeholder="" onkeyup="handlePersianInput({id: 'teamRole1'})" onchange="handleContinueStepBtn2()" /> -->
            <!-- ANCHOR: select/option for difrent types -->
            <select class="responsibility-type form-control input-data" onchange="handleContinueStepBtn2()" name="teamRole1" id="teamRole1">
              <option class="responsibility-type-default" value=""></option>
              <!-- for bookType -->
              <option class="d-none responsibility-bookType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-bookType" value="تصویرگر">
                تصویرگر
              </option>
              <option class="d-none responsibility-bookType" value="ناشر">
                ناشر
              </option>
              <!-- for animationType -->
              <option class="responsibility-animationType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="responsibility-animationType" value="کارگردان">
                کارگردان
              </option>
              <option class="responsibility-animationType" value="نویسنده">
                نویسنده
              </option>
              <option class="responsibility-animationType" value="مدیر هنری و انیمیت">
                مدیر هنری و انیمیت
              </option>
              <option class="responsibility-animationType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for dollyType -->
              <option class="d-none responsibility-dollyType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-dollyType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-dollyType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-dollyType" value="عروسک گردان">
                عروسک گردان
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر هنری">
                مدیر هنری
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر فنی">
                مدیر فنی
              </option>

              <!-- for webSeriesType -->
              <option class="d-none responsibility-webSeriesType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-webSeriesType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-webSeriesType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-webSeriesType" value="انیماتور">
                انیماتور
              </option>
              <option class="d-none responsibility-webSeriesType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for practicalAppType -->
              <option class="d-none responsibility-practicalAppType" value="طراح">
                طراح
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر محصول">
                مدیر محصول
              </option>
              <option class="d-none responsibility-practicalAppType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-practicalAppType" value="طراح کاربری">
                طراح کاربری
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر پشتیبانی">
                مدیر پشتیبانی
              </option>

              <!-- for videoGameType -->
              <option class="d-none responsibility-videoGameType" value="طراح بازی">
                طراح بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر پروژه">
                مدیر پروژه
              </option>
              <option class="d-none responsibility-videoGameType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-videoGameType" value=" طراح مراحل بازی">
                طراح مراحل بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر لانچ بازی">
                مدیر لانچ بازی
              </option>

            </select>

            <p id="teamRole1-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 1 مگابایت باشد</p>
            </div>
            <div class="">
              <!-- REVIEW -->
              <div class="">
                <input type="file" id="" name="teamAvatar1" accept="image/png, image/jpeg">
              </div>
            </div>
            <p id="teamUpload1-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="teamUpload1-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 1 مگابایت باشد</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-member">
      <p class="title-txt txt-blue">عضو 2</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="teamMember2">نام و نام خانوادگی</label>
            <input type="text" name="teamName2" class="form-control input-data" id="teamMember2" required="" placeholder="" onkeyup="handlePersianInput({id: 'teamMember2'})" onchange="handleContinueStepBtn2()" />
            <p id="teamMember2-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="teamRole2">مسئولیت</label>
            <!-- <input type="text" name="teamRole2" class="form-control input-data" id="teamRole2" required="" placeholder="" onkeyup="handlePersianInput({id: 'teamRole2'})" onchange="handleContinueStepBtn2()" /> -->
            <select class="responsibility-type form-control input-data" onchange="handleContinueStepBtn2()" name="teamRole2" id="teamRole2">
              <option class="responsibility-type-default" value=""></option>
              <!-- for bookType -->
              <option class="d-none responsibility-bookType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-bookType" value="تصویرگر">
                تصویرگر
              </option>
              <option class="d-none responsibility-bookType" value="ناشر">
                ناشر
              </option>
              <!-- for animationType -->
              <option class="responsibility-animationType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="responsibility-animationType" value="کارگردان">
                کارگردان
              </option>
              <option class="responsibility-animationType" value="نویسنده">
                نویسنده
              </option>
              <option class="responsibility-animationType" value="مدیر هنری و انیمیت">
                مدیر هنری و انیمیت
              </option>
              <option class="responsibility-animationType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for dollyType -->
              <option class="d-none responsibility-dollyType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-dollyType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-dollyType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-dollyType" value="عروسک گردان">
                عروسک گردان
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر هنری">
                مدیر هنری
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر فنی">
                مدیر فنی
              </option>

              <!-- for webSeriesType -->
              <option class="d-none responsibility-webSeriesType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-webSeriesType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-webSeriesType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-webSeriesType" value="انیماتور">
                انیماتور
              </option>
              <option class="d-none responsibility-webSeriesType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for practicalAppType -->
              <option class="d-none responsibility-practicalAppType" value="طراح">
                طراح
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر محصول">
                مدیر محصول
              </option>
              <option class="d-none responsibility-practicalAppType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-practicalAppType" value="طراح کاربری">
                طراح کاربری
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر پشتیبانی">
                مدیر پشتیبانی
              </option>

              <!-- for videoGameType -->
              <option class="d-none responsibility-videoGameType" value="طراح بازی">
                طراح بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر پروژه">
                مدیر پروژه
              </option>
              <option class="d-none responsibility-videoGameType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-videoGameType" value=" طراح مراحل بازی">
                طراح مراحل بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر لانچ بازی">
                مدیر لانچ بازی
              </option>

            </select>
            <p id="teamRole2-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 1 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="teamAvatar2" accept="image/png, image/jpeg">
            </div>
            <p id="teamUpload2-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="teamUpload2-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 1 مگابایت باشد</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-member">
      <p class="title-txt txt-blue">عضو 3</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="teamMember3">نام و نام خانوادگی</label>
            <input type="text" name="teamName3" class="form-control input-data" id="teamMember3" required="" placeholder="" onkeyup="handlePersianInput({id: 'teamMember3'})" onchange="handleContinueStepBtn2()" />
            <p id="teamMember3-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="teamRole3">مسئولیت</label>
            <select class="responsibility-type form-control input-data" onchange="handleContinueStepBtn2()" name="teamRole3" id="teamRole3">
              <option class="responsibility-type-default" value=""></option>
              <!-- for bookType -->
              <option class="d-none responsibility-bookType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-bookType" value="تصویرگر">
                تصویرگر
              </option>
              <option class="d-none responsibility-bookType" value="ناشر">
                ناشر
              </option>
              <!-- for animationType -->
              <option class="responsibility-animationType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="responsibility-animationType" value="کارگردان">
                کارگردان
              </option>
              <option class="responsibility-animationType" value="نویسنده">
                نویسنده
              </option>
              <option class="responsibility-animationType" value="مدیر هنری و انیمیت">
                مدیر هنری و انیمیت
              </option>
              <option class="responsibility-animationType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for dollyType -->
              <option class="d-none responsibility-dollyType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-dollyType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-dollyType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-dollyType" value="عروسک گردان">
                عروسک گردان
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر هنری">
                مدیر هنری
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر فنی">
                مدیر فنی
              </option>

              <!-- for webSeriesType -->
              <option class="d-none responsibility-webSeriesType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-webSeriesType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-webSeriesType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-webSeriesType" value="انیماتور">
                انیماتور
              </option>
              <option class="d-none responsibility-webSeriesType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for practicalAppType -->
              <option class="d-none responsibility-practicalAppType" value="طراح">
                طراح
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر محصول">
                مدیر محصول
              </option>
              <option class="d-none responsibility-practicalAppType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-practicalAppType" value="طراح کاربری">
                طراح کاربری
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر پشتیبانی">
                مدیر پشتیبانی
              </option>

              <!-- for videoGameType -->
              <option class="d-none responsibility-videoGameType" value="طراح بازی">
                طراح بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر پروژه">
                مدیر پروژه
              </option>
              <option class="d-none responsibility-videoGameType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-videoGameType" value=" طراح مراحل بازی">
                طراح مراحل بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر لانچ بازی">
                مدیر لانچ بازی
              </option>

            </select>
            <p id="teamRole3-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 1 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="teamAvatar3" accept="image/png, image/jpeg">
            </div>
            <p id="teamUpload3-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="teamUpload3-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 1 مگابایت باشد</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-member">
      <p class="title-txt txt-blue">عضو 4</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt" for="teamMember4">نام و نام خانوادگی</label>
            <input type="text" name="teamMember4" class="form-control input-data" id="teamMember4" placeholder="" onkeyup="handlePersianInput({id: 'teamMember4'})" onchange="handleContinueStepBtn2()" />
            <p id="teamMember4-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt" for="teamRole4">مسئولیت</label>
            <select class="responsibility-type form-control input-data" onchange="handleContinueStepBtn2()" name="teamRole4" id="teamRole4">
              <option class="responsibility-type-default" value=""></option>
              <!-- for bookType -->
              <option class="d-none responsibility-bookType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-bookType" value="تصویرگر">
                تصویرگر
              </option>
              <option class="d-none responsibility-bookType" value="ناشر">
                ناشر
              </option>
              <!-- for animationType -->
              <option class="responsibility-animationType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="responsibility-animationType" value="کارگردان">
                کارگردان
              </option>
              <option class="responsibility-animationType" value="نویسنده">
                نویسنده
              </option>
              <option class="responsibility-animationType" value="مدیر هنری و انیمیت">
                مدیر هنری و انیمیت
              </option>
              <option class="responsibility-animationType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for dollyType -->
              <option class="d-none responsibility-dollyType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-dollyType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-dollyType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-dollyType" value="عروسک گردان">
                عروسک گردان
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر هنری">
                مدیر هنری
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر فنی">
                مدیر فنی
              </option>

              <!-- for webSeriesType -->
              <option class="d-none responsibility-webSeriesType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-webSeriesType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-webSeriesType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-webSeriesType" value="انیماتور">
                انیماتور
              </option>
              <option class="d-none responsibility-webSeriesType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for practicalAppType -->
              <option class="d-none responsibility-practicalAppType" value="طراح">
                طراح
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر محصول">
                مدیر محصول
              </option>
              <option class="d-none responsibility-practicalAppType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-practicalAppType" value="طراح کاربری">
                طراح کاربری
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر پشتیبانی">
                مدیر پشتیبانی
              </option>

              <!-- for videoGameType -->
              <option class="d-none responsibility-videoGameType" value="طراح بازی">
                طراح بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر پروژه">
                مدیر پروژه
              </option>
              <option class="d-none responsibility-videoGameType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-videoGameType" value=" طراح مراحل بازی">
                طراح مراحل بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر لانچ بازی">
                مدیر لانچ بازی
              </option>

            </select>
            <p id="teamRole4-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 1 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="teamAvatar4" accept="image/png, image/jpeg">
            </div>
            <p id="teamUpload4-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="teamUpload4-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 1 مگابایت باشد</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-member">
      <p class="title-txt txt-blue">عضو 5</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt" for="teamMember5">نام و نام خانوادگی</label>
            <input type="text" name="teamMember5" class="form-control input-data" id="teamMember5" placeholder="" onkeyup="handlePersianInput({id: 'teamMember5'})" onchange="handleContinueStepBtn2()" />
            <p id="teamMember5-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt" for="teamRole5">مسئولیت</label>
            <select class="responsibility-type form-control input-data" onchange="handleContinueStepBtn2()" name="teamRole5" id="teamRole5">
              <option class="responsibility-type-default" value=""></option>
              <!-- for bookType -->
              <option class="d-none responsibility-bookType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-bookType" value="تصویرگر">
                تصویرگر
              </option>
              <option class="d-none responsibility-bookType" value="ناشر">
                ناشر
              </option>
              <!-- for animationType -->
              <option class="responsibility-animationType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="responsibility-animationType" value="کارگردان">
                کارگردان
              </option>
              <option class="responsibility-animationType" value="نویسنده">
                نویسنده
              </option>
              <option class="responsibility-animationType" value="مدیر هنری و انیمیت">
                مدیر هنری و انیمیت
              </option>
              <option class="responsibility-animationType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for dollyType -->
              <option class="d-none responsibility-dollyType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-dollyType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-dollyType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-dollyType" value="عروسک گردان">
                عروسک گردان
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر هنری">
                مدیر هنری
              </option>
              <option class="d-none responsibility-dollyType" value="مدیر فنی">
                مدیر فنی
              </option>

              <!-- for webSeriesType -->
              <option class="d-none responsibility-webSeriesType" value="تهیه کننده">
                تهیه کننده
              </option>
              <option class="d-none responsibility-webSeriesType" value="کارگردان">
                کارگردان
              </option>
              <option class="d-none responsibility-webSeriesType" value="نویسنده">
                نویسنده
              </option>
              <option class="d-none responsibility-webSeriesType" value="انیماتور">
                انیماتور
              </option>
              <option class="d-none responsibility-webSeriesType" value="تدوینگر">
                تدوینگر
              </option>

              <!-- for practicalAppType -->
              <option class="d-none responsibility-practicalAppType" value="طراح">
                طراح
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر محصول">
                مدیر محصول
              </option>
              <option class="d-none responsibility-practicalAppType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-practicalAppType" value="طراح کاربری">
                طراح کاربری
              </option>
              <option class="d-none responsibility-practicalAppType" value="مدیر پشتیبانی">
                مدیر پشتیبانی
              </option>

              <!-- for videoGameType -->
              <option class="d-none responsibility-videoGameType" value="طراح بازی">
                طراح بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر پروژه">
                مدیر پروژه
              </option>
              <option class="d-none responsibility-videoGameType" value="توسعه دهنده">
                توسعه دهنده
              </option>
              <option class="d-none responsibility-videoGameType" value=" طراح مراحل بازی">
                طراح مراحل بازی
              </option>
              <option class="d-none responsibility-videoGameType" value="مدیر لانچ بازی">
                مدیر لانچ بازی
              </option>

            </select>
            <p id="teamRole5-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 1 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="teamAvatar5" accept="image/png, image/jpeg">
            </div>
            <p id="teamUpload5-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="teamUpload5-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 1 مگابایت باشد</p>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div class="end-box">
    <div id="tab-alert-2" class="d-none alert-box">
      <div class="row justify-content-center">
        <div class="col-md-8">
          <div class="alert fade show" role="alert">
            <span>هشدار!</span><span> پر کردن تمامی کادرهای ستاره‌دار الزامی است</span>
            <button type="button" class="close" data-dismiss="alert" aria-label="Close">
              <span aria-hidden="true">&times;</span>
            </button>
          </div>
        </div>
      </div>
    </div>

    <div class="btn-box mt-3">
      <button type="button" class="btn-page btn-txt" id="stepTwoContinueBtn" onclick="nextStep({
                                nextStepNumber: 3,
                                nextTab: 'tab-id-3',
                                currentTab: 'tab-id-2',
                                isFinalStep: false,
                                validation: handleValidationTab2
                                })">
        ادامه
      </button>
      <button type="submit" class="btn-page btn-txt btn-w-active" onclick="handlePrev({id: 1})">
        برگشت به عقب
      </button>
    </div>
  </div>
</div>
<!-- SECTION: End of Step 2 (معرفی اثر و شخصیت) -->
<!-- SECTION: Start of Step 3 (معرفی شخصیت ها) -->
<div class="d-none" id="tab-id-3">
  <h2 class="txt-blue">معرفی شخصیت ها</h2>
  <p>
    در این بخش، حداکثر سه شخصیت اصلی که در اثر فرهنگی معرفی و پرداخته شده معرفی می گردد.
  </p>
  <hr class="hr-seprator" />
  <div class="mt-0 information-box">
    <div class="sec-character">
      <p class="title-txt txt-blue">شخصیت 1</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="personName1">نام شخصیت</label>
            <input type="text" name="character" class="form-control input-data" id="personName1" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personName1'})" />
            <p id="personName1-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="personCreator1">نام طراح شخصیت</label>
            <input type="text" name="creator" class="form-control input-data" id="personCreator1" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personCreator1'})" />
            <p id="personCreator1-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 5 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="charImage" accept="image/png, image/jpeg">
            </div>
            <p id="personUpload1-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="personUpload1-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 5 مگابایت باشد</p>
          </div>
        </div>
      </div>
      <div class="row mt-5">
        <div class="col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="introducePerson1">معرفی</label>
            <textarea name="characterDesc" class="form-control input-data" id="introducePerson1" rows="3" placeholder="حداکثر 250 کلمه..." onchange="handleContinueStepBtn3()" onkeyup="handleDescriptionTab({id: 'introducePerson1', maxlength: 250})"></textarea>
            <p id="introducePerson1-maxlength-validation" class="d-none error-txt txt-pink">تعداد کلمات وارد شده بیش از حد مجاز است</p>
            <p id="introducePerson1-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-character">
      <p class="title-txt txt-blue">شخصیت 2</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="personName2">نام شخصیت</label>
            <input type="text" name="character2" class="form-control input-data" id="personName2" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personName2'})" />
            <p id="personName2-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="personCreator2">نام طراح شخصیت</label>
            <input type="text" name="creator2" class="form-control input-data" id="personCreator2" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personCreator2'})" />
            <p id="personCreator2-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 5 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="charImage2" accept="image/png, image/jpeg">
            </div>
            <p id="personUpload2-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="personUpload2-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 5 مگابایت باشد</p>
          </div>
        </div>
      </div>
      <div class="row mt-5">
        <div class="col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="introducePerson2">معرفی</label>
            <textarea name="characterDesc2" class="form-control input-data" id="introducePerson2" rows="3" placeholder="حداکثر 250 کلمه..." onchange="handleContinueStepBtn3()" onkeyup="handleDescriptionTab({id: 'introducePerson2', maxlength:250})"></textarea>
            <p id="introducePerson2-maxlength-validation" class="d-none error-txt txt-pink">تعداد کلمات وارد شده بیش از حد مجاز است</p>
            <p id="introducePerson2-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
      </div>
    </div>
    <div class="sec-character">
      <p class="title-txt txt-blue">شخصیت 3</p>
      <div class="row custom">
        <div class="col-md-6 col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="personName3">نام شخصیت</label>
            <input type="text" name="character3" class="form-control input-data" id="personName3" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personName3'})" />
            <p id="personName3-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
          <div class="form-group">
            <label class="lbl-txt requier" for="personCreator3">نام طراح شخصیت</label>
            <input type="text" name="creator3" class="form-control input-data" id="personCreator3" required="" placeholder="" onchange="handleContinueStepBtn3()" onkeyup="handlePersianInput({id: 'personCreator3'})" />
            <p id="personCreator3-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
        <div class="col-md-6 col-12">
          <div class="form-group upload">
            <div class="">
              <label class="lbl-txt" for="inputImg">بارگذاری عکس</label>
              <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
              <p class="note">حجم فایل باید حداکثر 5 مگابایت باشد</p>
            </div>
            <div class="">
              <input type="file" id="" name="charImage3" accept="image/png, image/jpeg">
            </div>
            <p id="personUpload3-validation" class="d-none error-txt txt-pink">فرمت عکس باید JPG یا PNG باشد</p>
            <p id="personUpload3-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 5 مگابایت باشد</p>
          </div>
        </div>
      </div>
      <div class="row mt-5">
        <div class="col-12">
          <div class="form-group">
            <label class="lbl-txt requier" for="introducePerson3">معرفی</label>
            <textarea name="characterDesc3" class="form-control input-data" id="introducePerson3" rows="3" placeholder="حداکثر 250 کلمه..." onchange="handleContinueStepBtn3()" onkeyup="handleDescriptionTab({id: 'introducePerson3', maxlength:250})"></textarea>
            <p id="introducePerson3-maxlength-validation" class="d-none error-txt txt-pink">تعداد کلمات وارد شده بیش از حد مجاز است</p>
            <p id="introducePerson3-validation" class="d-none error-txt txt-pink">فقط حروف فارسی وارد نمایید</p>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div class="end-box">
    <div id="tab-alert-3" class="d-none alert-box">
      <div class="row justify-content-center">
        <div class="col-md-8">
          <div class="alert fade show" role="alert">
            <span>هشدار!</span><span> پر کردن تمامی کادرهای ستاره‌دار الزامی است</span>
            <button type="button" class="close" data-dismiss="alert" aria-label="Close">
              <span aria-hidden="true">&times;</span>
            </button>
          </div>
        </div>
      </div>
    </div>

    <div class="btn-box mt-3">
      <button id="stepThreeContinueBtn" type="button" class="btn-page btn-txt" onclick="nextStep({
                                nextStepNumber: 4,
                                nextTab: 'tab-id-4',
                                currentTab: 'tab-id-3',
                                isFinalStep: false,
                                validation: handleValidationTab3
                                })">
        ادامه
      </button>
      <button type="submit" class="btn-page btn-txt btn-w-active" onclick="handlePrev({id: 2})">
        برگشت به عقب
      </button>
    </div>
  </div>
</div>
<!-- SECTION: End of Step 3 (معرفی شخصیت ها) -->
<!-- SECTION: Start of Step 4 (بارگذاری عکس‌های طرح) -->
<div class="d-none" id="tab-id-4">
  <div class="sec-upload">
    <div>
      <h2 class="mb-3 txt-blue">بارگذاری عکس‌های طرح</h2>
      <p class="mb-3">
        در این قسمت، تصاویر مرتبط با شخصیت‌های اصلی معرفی شده در اثر فرهنگی بارگذاری می شود.
      </p>
    </div>
    <div class="row custom">
      <div class="col-12">
        <div class="form-group upload">
          <div class="">
            <p class="note">فرمت عکس باید JPG یا PNG باشد</p>
            <p class="note">حجم فایل باید حداکثر 3 مگابایت باشد</p>
          </div>
          <div class="" id="documentUpload1">
            <div class="img-box">
              <img src="{{ asset('img/upload.png') }}" alt="upload" />
            </div>
            <div class="text">
              <p class="txt-gray">
                عکس های طرح را به اینجا بکشید
              </p>
              <p class="txt-gray">یا</p>
              <p class="txt-gray">برای بارگذاری کلیک نمایید</p>
            </div>
            <input type="file" onchange="finalStepBtnIsValid()" id="" name="image" accept="image/png, image/jpeg">
            <input type="file" onchange="finalStepBtnIsValid()" id="" name="image2" accept="image/png, image/jpeg">
            <input type="file" onchange="finalStepBtnIsValid()" id="" name="image3" accept="image/png, image/jpeg">
            <input type="file" onchange="finalStepBtnIsValid()" id="" name="image4" accept="image/png, image/jpeg">
          </div>
          <p id="documentUpload1-validation" class="d-none error-txt txt-pink">فرمت عکس باید PNG یا JPG باشد</p>
          <p id="documentUpload1-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 3 مگابایت باشد</p>
        </div>
      </div>
    </div>
  </div>
  <div class="sec-upload">
    <div>
      <h2 class="mb-3 txt-blue">بارگذاری فیلم‌کوتاه / تیزر طرح</h2>
      <p class="mb-3">
        در این قسمت، یک فیلم کوتاه یا تیزر معرفی کننده شخصیت‌های اصلی در صورت وجود بارگذاری می‌شود. این ویدئو باید بتواند ویژگی‌های شخصیت‌های اصلی معرفی شده در اثر فرهنگی را معرفی نماید.
      </p>
    </div>
    <div class="row custom">
      <div class="col-12">
        <div class="form-group upload">
          <div class="">
            <p class="note">حجم فایل باید حداکثر 10 مگابایت باشد</p>
          </div>
          <div class="">
            <div class="">
              <div class="img-box">
                <img src="{{ asset('img/upload.png') }}" alt="upload" />
              </div>
              <div class="text">
                <p class="txt-gray">
                  فیلم‌کوتاه / تیزر طرح را به اینجا بکشید
                </p>
                <p class="txt-gray">یا</p>
                <p class="txt-gray">برای بارگذاری کلیک نمایید</p>
              </div>
            </div>
            <!-- REVIEW -->
            <div class="">
              <input type="file" id="" name="teaser" accept="image/png, image/jpeg">
            </div>
          </div>
          <p id="documentUpload2-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 10 مگابایت باشد</p>
        </div>
      </div>
    </div>
  </div>
  <div class="sec-upload">
    <div>
      <h2 class="mb-3 txt-blue">بارگذاری تاییدیه‌های ثبت طرح</h2>
      <p class="mb-3">
        در این قسمت، تائیدیه های ثبت طرح در مورد شخصیت‌های اصلی اثر فرهنگی بارگذاری می‌شود. این تائیدیه‌ها نشان دهنده ثبت طرح شخصیت‌های اصلی در نهادهایی همچون خانه سینما، کانون پرورش فکری کودکان و نوجوانان، سامانه ثبت آثار ادبی و هنری وزارت فرهنگ و ارشاد اسلامی، ثبت علائم تجاری در سازمان ثبت اسناد و املاک کشور و یا سایر گزینه‌های ذی‌صلاح باشد.
      </p>
    </div>
    <div class="row custom">
      <div class="col-12">
        <div class="form-group upload">
          <div class="">
            <p class="note">فرمت عکس باید JPG یا PDF باشد</p>
            <p class="note">حجم فایل باید حداکثر 3 مگابایت باشد</p>
          </div>
          <div class="">
            <div class="">
              <div class="img-box">
                <img src="{{ asset('img/upload.png') }}" alt="upload" />
              </div>
              <div class="text">
                <p class="txt-gray">
                  تاییدیه های ثبت طرح را به اینجا بکشید
                </p>
                <p class="txt-gray">یا</p>
                <p class="txt-gray">برای بارگذاری کلیک نمایید</p>
              </div>
            </div>
            <!-- REVIEW -->
            <div class="">
              <input type="file" id="" name="certificate" accept="image/png, image/jpeg">
              <input type="file" id="" name="certificate2" accept="image/png, image/jpeg">
              <input type="file" id="" name="certificate3" accept="image/png, image/jpeg">
            </div>
          </div>
          <p id="documentUpload3-validation" class="d-none error-txt txt-pink">فرمت تاییدیه باید JPG یا PDF باشد</p>
          <p id="documentUpload3-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 3 مگابایت باشد</p>
        </div>
      </div>
    </div>
  </div>
  <div class="sec-upload">
    <div>
      <h2 class="mb-3 txt-blue">بارگذاری بیزنس پلن‌های طرح</h2>
      <p class="mb-3">
        در این قسمت، برنامه کسب و کار برای تجاری‌سازی شخصیت‌های اصلی اثر فرهنگی بارگذاری می‌شود. در این برنامه، طرح‌ریزی صورت گرفته برای حوزه‌های تجاری شخصیت‌های اصلی معرفی شده، مدل‌های درآمدزایی ناشی از تجاری‌سازی شخصیت‌های اصلی تبیین شده و پیش‌بینی‌های صورت گرفته از جریان نقدینگی در مراحل تجاری‌سازی شخصیت‌های اصلی ارائه می‌شود.
      </p>
    </div>
    <div class="row custom">
      <div class="col-12">
        <div class="form-group upload">
          <div class="">
            <p class="note">فرمت عکس باید PDF یا WORD باشد</p>
            <p class="note">حجم فایل باید حداکثر 3 مگابایت باشد</p>
          </div>
          <div class="">
            <div class="">
              <div class="img-box">
                <img src="{{ asset('img/upload.png') }}" alt="upload" />
              </div>
              <div class="text">
                <p class="txt-gray">بیزنس پلن طرح را به اینجا بکشید</p>
                <p class="txt-gray">یا</p>
                <p class="txt-gray">برای بارگذاری کلیک نمایید</p>
              </div>
            </div>
            <!-- REVIEW -->
            <div class="">
              <input type="file" id="" name="plan" accept="image/png, image/jpeg">
              <input type="file" id="" name="plan2" accept="image/png, image/jpeg">
              <input type="file" id="" name="plan3" accept="image/png, image/jpeg">
            </div>
          </div>
          <p id="documentUpload4-validation" class="d-none error-txt txt-pink">فرمت بیزنس پلن باید PDF یا WORD باشد</p>
          <p id="documentUpload4-maxlength-validation" class="d-none error-txt txt-pink">حجم فایل باید حداکثر 3 مگابایت باشد</p>
        </div>
      </div>
    </div>
  </div>
  <div class="end-box">
    <div class="d-none alert-box" id="tab-alert-4">
      <div class="row justify-content-center">
        <div class="col-md-8">
          <div class="alert fade show" role="alert">
            <span>هشدار!</span><span>
              پر کردن تمامی کادرهای ستاره&zwnj;دار الزامی است</span>
            <button type="button" class="close" data-dismiss="alert" aria-label="Close">
              <span aria-hidden="true">&times;</span>
            </button>
          </div>
        </div>
      </div>
    </div>
    <div class="btn-box mt-3">
      <button id="finalStepBtn" type="submit" class="btn-page btn-txt">
        تایید نهایی
      </button>
      <button id="refuseBtn" type="button" class="btn-page btn-txt btn-w-active" onclick="handlePrev({id: 3})">
        برگشت به عقب
      </button>
    </div>
  </div>
</div>
{!! Form::close() !!}
<!-- SECTION: End of Step 4 (بارگذاری عکس‌های طرح) -->
@endsection


@section('footer-assets')
<script>
  // dropzone
  $("div#myId").dropzone({
    url: "/file/post"
  });

  // NOTE: teamUpload
  maxTeamFileSize = 1;

  Dropzone.options.teamUpload1 = {
    acceptedFiles: 'image/*',
    maxFilesize: 1,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxTeamFileSize) {
            document.getElementById("teamUpload1-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("teamUpload1-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("teamUpload1-maxlength-validation").classList.add("d-none");
      document.getElementById("teamUpload1-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.teamUpload2 = {
    acceptedFiles: 'image/*',
    maxFilesize: 1,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxTeamFileSize) {
            document.getElementById("teamUpload2-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("teamUpload2-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("teamUpload2-maxlength-validation").classList.add("d-none");
      document.getElementById("teamUpload2-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.teamUpload3 = {
    acceptedFiles: 'image/*',
    maxFilesize: 1,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxTeamFileSize) {
            document.getElementById("teamUpload3-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("teamUpload3-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("teamUpload3-maxlength-validation").classList.add("d-none");
      document.getElementById("teamUpload3-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.teamUpload4 = {
    acceptedFiles: 'image/*',
    maxFilesize: 1,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxTeamFileSize) {
            document.getElementById("teamUpload4-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("teamUpload4-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("teamUpload4-maxlength-validation").classList.add("d-none");
      document.getElementById("teamUpload4-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.teamUpload5 = {
    acceptedFiles: 'image/*',
    maxFilesize: 1,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxTeamFileSize) {
            document.getElementById("teamUpload5-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("teamUpload5-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("teamUpload5-maxlength-validation").classList.add("d-none");
      document.getElementById("teamUpload5-validation").classList.add("d-none");
      done();
    },
  }

  // NOTE: personUpload

  maxPersonFileSize = 5;

  Dropzone.options.personUpload1 = {
    acceptedFiles: 'image/*',
    maxFilesize: 5,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxPersonFileSize) {
            document.getElementById("personUpload1-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("personUpload1-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("personUpload1-maxlength-validation").classList.add("d-none");
      document.getElementById("personUpload1-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.personUpload2 = {
    acceptedFiles: 'image/*',
    maxFilesize: 5,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxPersonFileSize) {
            document.getElementById("personUpload2-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("personUpload2-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("personUpload2-maxlength-validation").classList.add("d-none");
      document.getElementById("personUpload2-validation").classList.add("d-none");
      done();
    },
  }

  Dropzone.options.personUpload3 = {
    acceptedFiles: 'image/*',
    maxFilesize: 5,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxPersonFileSize) {
            document.getElementById("personUpload3-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("personUpload3-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
    },
    accept: function(file, done) {
      document.getElementById("personUpload3-maxlength-validation").classList.add("d-none");
      document.getElementById("personUpload3-validation").classList.add("d-none");
      done();
    },
  }

  // NOTE: documentUpload
  maxDocumentFileSizeDefault = 3;
  maxDocument2FileSize = 10;

  Dropzone.options.documentUpload1 = {
    acceptedFiles: 'image/*',
    maxFilesize: 3,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxDocumentFileSizeDefault) {
            document.getElementById("documentUpload1-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg") {
            document.getElementById("documentUpload1-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
      this.on("addedfile", finalStepBtnCheck);
    },
    accept: function(file, done) {
      document.getElementById("documentUpload1-maxlength-validation").classList.add("d-none");
      document.getElementById("documentUpload1-validation").classList.add("d-none");
      done();
      finalStepBtnCheck();
    },
  }

  Dropzone.options.documentUpload2 = {
    maxFilesize: 10,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxDocument2FileSize) {
            document.getElementById("documentUpload2-maxlength-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
        this.on("addedfile", finalStepBtnCheck);
      });
    },
    accept: function(file, done) {
      document.getElementById("documentUpload2-maxlength-validation").classList.add("d-none");
      done();
      finalStepBtnCheck();
    },
  }

  Dropzone.options.documentUpload3 = {
    acceptedFiles: "image/*,application/pdf,.pdf",
    maxFilesize: 3,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxDocumentFileSizeDefault) {
            document.getElementById("documentUpload3-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== "image/jpeg" || file.type !== "image/png" || file.type !== "image/jpg" || file.type !== "application/pdf" || file.type !== "pdf") {
            document.getElementById("documentUpload3-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
      this.on("addedfile", finalStepBtnCheck);
    },
    accept: function(file, done) {
      document.getElementById("documentUpload3-maxlength-validation").classList.add("d-none");
      document.getElementById("documentUpload3-validation").classList.add("d-none");
      done();
      finalStepBtnCheck();
    },
  }

  Dropzone.options.documentUpload4 = {
    acceptedFiles: '.doc, .docx, .pdf, .xls, .xlsx, application/msword,application/vnd.openxmlformats-officedocument.wordprocessingml.document,application/vnd.ms-excel,application/vnd.openxmlformats-officedocument.spreadsheetml.sheet,application/pdf',
    maxFilesize: 3,
    init: function() {
      this.on("error", function(file) {
        if (!file.accepted) {
          if (+(file.size / 1000000).toFixed(2) > maxDocumentFileSizeDefault) {
            document.getElementById("documentUpload4-maxlength-validation").classList.remove("d-none");
          }

          if (file.type !== ".doc" || file.type !== ".docx" || file.type !== " .pdf" || file.type !== ".xls" || file.type !== ".xlsx" || file.type !== " application/msword" || file.type !== "application/vnd.openxmlformats-officedocument.wordprocessingml.document" || file.type !== "application/vnd.ms-excel" || file.type !== "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet" || file.type !== "application/pdf") {
            document.getElementById("documentUpload4-validation").classList.remove("d-none");
          }
          this.removeFile(file);
        }
      });
      this.on("addedfile", finalStepBtnCheck);
    },
    accept: function(file, done) {
      document.getElementById("documentUpload4-maxlength-validation").classList.add("d-none");
      document.getElementById("documentUpload4-validation").classList.add("d-none");
      done();
      finalStepBtnCheck();
    },
  }
</script>

<script>
  var currentTab = 0; // Current tab is set to be the first tab (0)
  showTab(currentTab); // Display the current tab

  function showTab(n) {
    // This function will display the specified tab of the form...
    var x = document.getElementsByClassName("tab");
    x[n].style.display = "block";
    //... and fix the Previous/Next buttons:
    if (n == 0) {
      document.getElementById("prevBtn").style.display = "none";
    } else {
      document.getElementById("prevBtn").style.display = "inline";
    }
    if (n == x.length - 1) {
      document.getElementById("nextBtn").innerHTML = "ذخیره";
    } else {
      document.getElementById("nextBtn").innerHTML = "بعدی";
    }
    //... and run a function that will display the correct step indicator:
    fixStepIndicator(n);
  }

  function nextPrev(n) {
    // This function will figure out which tab to display
    var x = document.getElementsByClassName("tab");
    // Exit the function if any field in the current tab is invalid:
    if (n == 1 && !validateForm()) return false;
    // Hide the current tab:
    x[currentTab].style.display = "none";
    // Increase or decrease the current tab by 1:
    currentTab = currentTab + n;
    // if you have reached the end of the form...
    if (currentTab >= x.length) {
      // ... the form gets submitted:
      document.getElementById("regForm").submit();
      return false;
    }
    // Otherwise, display the correct tab:
    showTab(currentTab);
  }

  function validateForm() {
    // This function deals with validation of the form fields
    var x,
      y,
      i,
      valid = true;
    x = document.getElementsByClassName("tab");
    y = x[currentTab].getElementsByTagName("input");
    // A loop that checks every input field in the current tab:
    for (i = 0; i < y.length; i++) {
      // If a field is empty...
      if (y[i].value == "") {
        // add an "invalid" class to the field:
        y[i].className += " invalid";
        // and set the current valid status to false
        valid = true;
      }
    }
    // If the valid status is true, mark the step as finished and valid:
    if (valid) {
      document.getElementsByClassName("step")[currentTab].className +=
        " finish";
    }
    return valid; // return the valid status
  }

  function fixStepIndicator(n) {
    // This function removes the "active" class of all steps...
    var i,
      x = document.getElementsByClassName("step");
    for (i = 0; i < x.length; i++) {
      x[i].className = x[i].className.replace(" active", "");
    }
    //... and adds the "active" class on the current step:
    x[n].className += " active";
  }

  // SECTION: next step handler
  function nextStep({
    nextStepNumber,
    nextTab,
    currentTab,
    isFinalStep,
    validation
  }) {
    //let isValid = validation();
    let isValid = true;

    if (isValid) {
      document.documentElement.scrollTop = 0;
      // run func to handle validations
      let currentLinkBox = document.getElementById(
        `link-${nextStepNumber - 1}`
      );

      let linkLine = document.getElementById(
        `link-line-${nextStepNumber - 1}`
      );

      /* ------------------------------------ */
      currentLinkBox.classList.remove("active");
      currentLinkBox.classList.add("done");

      linkLine.classList.remove("undone");
      linkLine.classList.add("done");
      /* ------------------------------------ */

      let nextLinkBox = document.getElementById(`link-${nextStepNumber}`);

      nextLinkBox.classList.add("active");

      document.getElementById(currentTab).classList.add("d-none");
      document.getElementById(nextTab).classList.remove("d-none");
    }
  }

  function handlePrev({
    id
  }) {
    let currentLink = document.getElementById(`link-${id}`).classList;
    document.getElementById(`link-line-${id}`).classList.remove("done");

    if (currentLink.contains("done")) {
      currentLink.add("active");
    }

    for (let i = id + 1; i <= 4; i++) {
      let link = document.getElementById(`link-${i}`).classList;

      if (link.contains("done")) {
        link.remove("done");
        link.add("undone");
        document.getElementById(`link-line-${i}`).classList.remove("done");
      }
      if (link.contains("active")) {
        document.getElementById(`tab-id-${i}`).classList.add("d-none");
        document.getElementById(`tab-id-${id}`).classList.remove("d-none");
        link.remove("active");
        link.add("undone");
        document.getElementById(`link-line-${i}`).classList.remove("done");
      }
    }

    document.documentElement.scrollTop = 0;
  }

  /* -------------------------- NOTE: Validations -------------------------- */
  function handlePersianInput({
    id
  }) {
    let text = document.getElementById(id).value.replace(/\s/g);
    let validationClass = document.getElementById(`${id}-validation`).classList;
    let lang = {
      "persian": /[\u0600-\u06FF-\u0750-\u077F]/,
    }
    const keys = Object.entries(lang);
    let isPersian = false

    Object.entries(lang).forEach(([key, value]) => {
      if (value.test(text) == true || text.length === 0) {
        validationClass.contains("d-none") && text.length ? true : validationClass.add("d-none");
        isPersian = true
      } else {
        isPersian = false
        return validationClass.remove("d-none")
      }
    });

    return isPersian
  }

  function handleCreateYearInput({
    id
  }) {
    let value = document.getElementById(id).value;

    let persianNumbers = [/۰/g, /۱/g, /۲/g, /۳/g, /۴/g, /۵/g, /۶/g, /۷/g, /۸/g, /۹/g];
    let isNumber = false;

    if (isNaN(+value)) {
      for (var i = 0; i < 10; i++) {
        value = value.replace(persianNumbers[i], i);
      }
    }

    if (isNaN(+value)) {
      document.getElementById(`${id}-validation`).classList.remove("d-none");
      isNumber = false;
    } else {
      document.getElementById(`${id}-validation`).classList.add("d-none");
      isNumber = true;
    }

    if (isNumber && value !== "") {
      let currentYear = getCurrentYear();
      if (value < 1350 || value > +currentYear) {
        document.getElementById(`${id}-year-validation`).classList.remove("d-none");
      } else {
        document.getElementById(`${id}-year-validation`).classList.add("d-none");
      }
    } else {
      document.getElementById(`${id}-year-validation`).classList.add("d-none");
    }

    return isNumber;
  }

  function getCurrentYear() {
    let persianNumbers = [/۰/g, /۱/g, /۲/g, /۳/g, /۴/g, /۵/g, /۶/g, /۷/g, /۸/g, /۹/g];
    let currentYear = new Date().toLocaleDateString('fa-IR', {
      year: 'numeric'
    });

    for (var i = 0; i < 10; i++) {
      currentYear = currentYear.replace(persianNumbers[i], i);
    }

    return currentYear;
  }

  function handleEnglishInput({
    id
  }) {
    let text = document.getElementById(id).value.replace(/\s/g);
    let validationClass = document.getElementById(`${id}-validation`).classList;
    let lang = {
      "english": /^[a-zA-Z]+$/,
    }
    const keys = Object.entries(lang);
    let isEnglish = false;

    Object.entries(lang).forEach(([key, value]) => {
      if (value.test(text) == true || text.length === 0) {
        isEnglish = true;
        return validationClass.contains("d-none") && text.length ? true : validationClass.add("d-none")
      } else {
        isEnglish = false;
        validationClass.remove("d-none")
      }
    });
    return isEnglish;
  }

  function handleMaxLength({
    id,
    maxlength
  }) {
    let wordCount = document.getElementById(id).value.split(" ").length;

    let maxLengthValidationClass = document.getElementById(`${id}-maxlength-validation`).classList;
    if (wordCount > maxlength) {
      maxLengthValidationClass.remove("d-none");
      return false;
    } else {
      maxLengthValidationClass.add("d-none")
      return true;
    }
  }

  function handleDescriptionTab({
    id,
    maxlength
  }) {
    let isInRange = handleMaxLength({
      id,
      maxlength
    });
    let isPersian = handlePersianInput({
      id
    });

    return isInRange && isPersian;
  }

  // feature-effect-des (ویژگی‌های اثر) help paragraph
  function handleFeatureEffectHelp(id) {
    document.querySelectorAll("#feature-help-box > li.note-txt.txt-gray").forEach(element => element.classList.add("d-none"));
    document.getElementById(id).classList.remove("d-none");

    // for select/option tab2
    document.querySelectorAll(".responsibility-type option").forEach(element => element.classList.add("d-none"));
    document.querySelectorAll(".responsibility-type-default").forEach(element => {
      element.classList.remove("d-none");
      element.setAttribute('selected', 'selected')
    })
    // document.querySelectorAll(".responsibility-type-default").forEach(element => element.setAttribute('selected', 'selected'))
    document.querySelectorAll(`.responsibility-${id}`).forEach(element => element.classList.remove("d-none"))
  }

  function handleTypeofEffects(e) {
    switch (e.target.value) {
      case "کتاب":
        handleFeatureEffectHelp("bookType");
        break;

      case "عروسکی":
        handleFeatureEffectHelp("dollyType");
        break;

      case "پویانمایی":
        handleFeatureEffectHelp("animationType");
        break;

      case "برنامه کاربردی":
        handleFeatureEffectHelp("practicalAppType");
        break;

      case "وب سریز":
        handleFeatureEffectHelp("webSeriesType");
        break;


      case "بازی های ویدئویی":
        handleFeatureEffectHelp("videoGameType");
        break;

      default:
        break;
    }
  }
  /* ----------------------------------------------------------------------- */

  function handleValidationTab1() {
    let name = document.getElementById("name");
    let nameEn = document.getElementById("nameEn");
    let yearCreate = document.getElementById("yearCreate");
    let featureItemDes = document.getElementById("feature-effect-des");
    let description = document.getElementById("description");

    let nameRes = handlePersianInput({
      id: "name"
    });
    let isNameValid = nameRes && !!name.value.length;

    let yearCreateRes = handleCreateYearInput({
      id: "yearCreate"
    });
    let isYearCreateValid = yearCreateRes && !!yearCreate.value.length;

    let isDescriptionValid = handleDescriptionTab({
      id: "description",
      maxlength: 500
    }) && !!description.value;

    let isFeatureItemDesValid = handleDescriptionTab({
      id: "feature-effect-des",
      maxlength: 100
    }) && !!featureItemDes.value;

    let isValid = isNameValid && isFeatureItemDesValid && isYearCreateValid && isDescriptionValid;

    if (!isValid) {
      document.getElementById("tab-alert-1").classList.remove("d-none")
    }

    return isValid;
  }

  function handleContinueStepBtn1() {
    let name = document.getElementById("name");
    let yearCreate = document.getElementById("yearCreate");
    let featureItemDes = document.getElementById("feature-effect-des");
    let description = document.getElementById("description");

    let nameRes = handlePersianInput({
      id: "name"
    });
    let isNameValid = nameRes && !!name.value.length;


    let nameEnRes = handleEnglishInput({
      id: "nameEn"
    });
    let isNameEnValid = nameEnRes && !!nameEn.value.length;

    let yearCreateRes = handleCreateYearInput({
      id: "yearCreate"
    });
    let isYearCreateValid = yearCreateRes && !!yearCreate.value.length;

    let isDescriptionValid = handleDescriptionTab({
      id: "description",
      maxlength: 500
    }) && !!description.value;

    let isFeatureItemDesValid = handleDescriptionTab({
      id: "feature-effect-des",
      maxlength: 100
    }) && !!featureItemDes.value;

    if (isNameValid && isFeatureItemDesValid && isYearCreateValid && isDescriptionValid) {
      document.getElementById("stepOneContinueBtn").classList.remove("btn-y-disable")
      document.getElementById("stepOneContinueBtn").classList.add("btn-y-active")
    } else {
      document.getElementById("stepOneContinueBtn").classList.add("btn-y-disable");
    }
  }

  // ----------------------------


  // NOTE: Tab2
  function handleValidationTab2() {
    let teamMember1 = document.getElementById("teamMember1");
    let teamMember2 = document.getElementById("teamMember2");
    let teamMember3 = document.getElementById("teamMember3");
    // let teamMember4 = document.getElementById("teamMember4");
    // let teamMember5 = document.getElementById("teamMember5");
    let teamRole1 = document.getElementById("teamRole1");
    let teamRole2 = document.getElementById("teamRole2");
    let teamRole3 = document.getElementById("teamRole3");
    // let teamRole4 = document.getElementById("teamRole4");
    // let teamRole5 = document.getElementById("teamRole5");

    let teamMember1Res = handlePersianInput({
      id: "teamMember1"
    });
    let isTeamMember1Valid = teamMember1Res && !!teamMember1.value.length;

    let teamMember2Res = handlePersianInput({
      id: "teamMember2"
    });
    let isTeamMember2Valid = teamMember2Res && !!teamMember2.value.length;

    let teamMember3Res = handlePersianInput({
      id: "teamMember3"
    });
    let isTeamMember3Valid = teamMember3Res && !!teamMember3.value.length;

    // let teamMember4Res = handlePersianInput({
    //   id: "teamMember4"
    // });
    // let isTeamMember4Valid = teamMember4Res && !!teamMember4.value.length;

    // let teamMember5Res = handlePersianInput({
    //   id: "teamMember5"
    // });
    // let isTeamMember5Valid = teamMember5Res && !!teamMember5.value.length;

    let teamRole1Res = handlePersianInput({
      id: "teamRole1"
    });
    let isTeamRole1Valid = teamRole1Res && !!teamRole1.value.length;

    let teamRole2Res = handlePersianInput({
      id: "teamRole2"
    });
    let isTeamRole2Valid = teamRole2Res && !!teamRole2.value.length;

    let teamRole3Res = handlePersianInput({
      id: "teamRole3"
    });
    let isTeamRole3Valid = teamRole3Res && !!teamRole3.value.length;

    // let teamRole4Res = handlePersianInput({
    //   id: "teamRole4"
    // });
    // let isTeamRole4Valid = teamRole4Res && !!teamRole4.value.length;

    // let teamRole5Res = handlePersianInput({
    //   id: "teamRole5"
    // });
    // let isTeamRole5Valid = teamRole5Res && !!teamRole5.value.length;


    let isValid = isTeamMember1Valid && isTeamMember2Valid &&
      isTeamMember3Valid && isTeamRole1Valid &&
      isTeamRole2Valid && isTeamRole3Valid;
    // isTeamMember4Valid && isTeamMember5Valid &&
    // && isTeamRole4Valid && isTeamRole5Valid;

    if (!isValid) {
      document.getElementById("tab-alert-2").classList.remove("d-none")
    }

    return isValid;
  }


  function handleContinueStepBtn2() {
    let teamMember1 = document.getElementById("teamMember1");
    let teamMember2 = document.getElementById("teamMember2");
    let teamMember3 = document.getElementById("teamMember3");
    // let teamMember4 = document.getElementById("teamMember4");
    // let teamMember5 = document.getElementById("teamMember5");
    let teamRole1 = document.getElementById("teamRole1");
    let teamRole2 = document.getElementById("teamRole2");
    let teamRole3 = document.getElementById("teamRole3");
    // let teamRole4 = document.getElementById("teamRole4");
    // let teamRole5 = document.getElementById("teamRole5");

    let teamMember1Res = handlePersianInput({
      id: "teamMember1"
    });
    let isTeamMember1Valid = teamMember1Res && !!teamMember1.value.length;

    let teamMember2Res = handlePersianInput({
      id: "teamMember2"
    });
    let isTeamMember2Valid = teamMember2Res && !!teamMember2.value.length;

    let teamMember3Res = handlePersianInput({
      id: "teamMember3"
    });
    let isTeamMember3Valid = teamMember3Res && !!teamMember3.value.length;

    // let teamMember4Res = handlePersianInput({
    //   id: "teamMember4"
    // });
    // let isTeamMember4Valid = teamMember4Res && !!teamMember4.value.length;

    // let teamMember5Res = handlePersianInput({
    //   id: "teamMember5"
    // });
    // let isTeamMember5Valid = teamMember5Res && !!teamMember5.value.length;

    let teamRole1Res = handlePersianInput({
      id: "teamRole1"
    });
    let isTeamRole1Valid = teamRole1Res && !!teamRole1.value.length;

    let teamRole2Res = handlePersianInput({
      id: "teamRole2"
    });
    let isTeamRole2Valid = teamRole2Res && !!teamRole2.value.length;

    let teamRole3Res = handlePersianInput({
      id: "teamRole3"
    });
    let isTeamRole3Valid = teamRole3Res && !!teamRole3.value.length;

    // let teamRole4Res = handlePersianInput({
    //   id: "teamRole4"
    // });
    // let isTeamRole4Valid = teamRole4Res && !!teamRole4.value.length;

    // let teamRole5Res = handlePersianInput({
    //   id: "teamRole5"
    // });
    // let isTeamRole5Valid = teamRole5Res && !!teamRole5.value.length;


    let isValid = isTeamMember1Valid && isTeamMember2Valid &&
      isTeamMember3Valid && isTeamRole1Valid &&
      isTeamRole2Valid && isTeamRole3Valid;
    // isTeamMember4Valid && isTeamMember5Valid
    // && isTeamRole4Valid && isTeamRole5Valid;

    if (isValid) {
      document.getElementById("stepTwoContinueBtn").classList.remove("btn-y-disable")
      document.getElementById("stepTwoContinueBtn").classList.add("btn-y-active")
    } else {
      document.getElementById("stepTwoContinueBtn").classList.add("btn-y-disable");
    }
  }
  // ----------------------------


  // NOTE: Tab3
  function handleValidationTab3() {
    let personName1 = document.getElementById("personName1");
    let personName2 = document.getElementById("personName2");
    let personName3 = document.getElementById("personName3");
    let personCreator1 = document.getElementById("personCreator1");
    let personCreator2 = document.getElementById("personCreator2");
    let personCreator3 = document.getElementById("personCreator3");
    let introducePerson1 = document.getElementById("introducePerson1");
    let introducePerson2 = document.getElementById("introducePerson2");
    let introducePerson3 = document.getElementById("introducePerson3");

    let personName1Res = handlePersianInput({
      id: "personName1"
    });
    let isPersonName1Valid = personName1Res && !!personName1.value.length;

    let personName2Res = handlePersianInput({
      id: "personName2"
    });
    let isPersonName2Valid = personName2Res && !!personName2.value.length;

    let personName3Res = handlePersianInput({
      id: "personName3"
    });
    let isPersonName3Valid = personName3Res && !!personName3.value.length;

    let personCreator1Res = handlePersianInput({
      id: "personCreator1"
    });
    let isPersonCreator1Valid = personCreator1Res && !!personCreator1.value.length;

    let personCreator2Res = handlePersianInput({
      id: "personCreator2"
    });
    let isPersonCreator2Valid = personCreator2Res && !!personCreator2.value.length;

    let personCreator3Res = handlePersianInput({
      id: "personCreator3"
    });
    let isPersonCreator3Valid = personCreator3Res && !!personCreator3.value.length;

    let isIntroducePerson1Valid = handleDescriptionTab({
      id: "introducePerson1",
      maxlength: 250
    }) && !!introducePerson1.value;
    let isIntroducePerson2Valid = handleDescriptionTab({
      id: "introducePerson2",
      maxlength: 250
    }) && !!introducePerson2.value;
    let isIntroducePerson3Valid = handleDescriptionTab({
      id: "introducePerson3",
      maxlength: 250
    }) && !!introducePerson3.value;


    let isValid = isPersonName1Valid && isPersonName2Valid &&
      isPersonName3Valid && isPersonCreator1Valid &&
      isPersonCreator2Valid && isPersonCreator3Valid &&
      isIntroducePerson1Valid && isIntroducePerson2Valid &&
      isIntroducePerson3Valid;

    if (!isValid) {
      document.getElementById("tab-alert-3").classList.remove("d-none")
    }

    return isValid;
  }


  function handleContinueStepBtn3() {
    let personName1 = document.getElementById("personName1");
    let personName2 = document.getElementById("personName2");
    let personName3 = document.getElementById("personName3");
    let personCreator1 = document.getElementById("personCreator1");
    let personCreator2 = document.getElementById("personCreator2");
    let personCreator3 = document.getElementById("personCreator3");
    let introducePerson1 = document.getElementById("introducePerson1");
    let introducePerson2 = document.getElementById("introducePerson2");
    let introducePerson3 = document.getElementById("introducePerson3");

    let personName1Res = handlePersianInput({
      id: "personName1"
    });
    let isPersonName1Valid = personName1Res && !!personName1.value.length;

    let personName2Res = handlePersianInput({
      id: "personName2"
    });
    let isPersonName2Valid = personName2Res && !!personName2.value.length;

    let personName3Res = handlePersianInput({
      id: "personName3"
    });
    let isPersonName3Valid = personName3Res && !!personName3.value.length;

    let personCreator1Res = handlePersianInput({
      id: "personCreator1"
    });
    let isPersonCreator1Valid = personCreator1Res && !!personCreator1.value.length;

    let personCreator2Res = handlePersianInput({
      id: "personCreator2"
    });
    let isPersonCreator2Valid = personCreator2Res && !!personCreator2.value.length;

    let personCreator3Res = handlePersianInput({
      id: "personCreator3"
    });
    let isPersonCreator3Valid = personCreator3Res && !!personCreator3.value.length;

    let isIntroducePerson1Valid = handleDescriptionTab({
      id: "introducePerson1",
      maxlength: 250
    }) && !!introducePerson1.value;
    let isIntroducePerson2Valid = handleDescriptionTab({
      id: "introducePerson2",
      maxlength: 250
    }) && !!introducePerson2.value;
    let isIntroducePerson3Valid = handleDescriptionTab({
      id: "introducePerson3",
      maxlength: 250
    }) && !!introducePerson3.value;


    let isValid = isPersonName1Valid && isPersonName2Valid &&
      isPersonName3Valid && isPersonCreator1Valid &&
      isPersonCreator2Valid && isPersonCreator3Valid &&
      isIntroducePerson1Valid && isIntroducePerson2Valid &&
      isIntroducePerson3Valid;

    if (isValid) {
      document.getElementById("stepThreeContinueBtn").classList.remove("btn-y-disable")
      document.getElementById("stepThreeContinueBtn").classList.add("btn-y-active")
    } else {
      document.getElementById("stepThreeContinueBtn").classList.add("btn-y-disable");
    }
  }
  // ----------------------------

  // NOTE: tab4
  function finalStepBtnCheck() {
    let documentUpload1 = document.getElementById("documentUpload1");
    console.log(documentUpload1);

  }

  function finalStepBtnIsValid() {
    let isValid = false;
    let count1 = 0;
    let files1 = document.getElementById("documentUpload1").querySelectorAll("input[type=file]").forEach(file => file.value && ++count1)
    if (count1 >= 3) {
      isValid = true;
      document.getElementById("finalStepBtn").classList.remove("btn-y-disable")
      document.getElementById("finalStepBtn").classList.add("btn-y-active")
    } else {
      isValid = false;
      document.getElementById("finalStepBtn").classList.remove("btn-y-active")
      document.getElementById("finalStepBtn").classList.add("btn-y-disable")
    }
    return isValid
  }
</script>
<input type="file" multiple="multiple" class="dz-hidden-input" style="
    visibility: hidden;
    position: absolute;
    top: 0px;
    left: 0px;
    height: 0px;
    width: 0px;
  " /><input type="file" multiple="multiple" class="dz-hidden-input" style="
    visibility: hidden;
    position: absolute;
    top: 0px;
    left: 0px;
    height: 0px;
    width: 0px;
  " /><input type="file" multiple="multiple" class="dz-hidden-input" style="
    visibility: hidden;
    position: absolute;
    top: 0px;
    left: 0px;
    height: 0px;
    width: 0px;
  " /><input type="file" multiple="multiple" class="dz-hidden-input" style="
    visibility: hidden;
    position: absolute;
    top: 0px;
    left: 0px;
    height: 0px;
    width: 0px;
  " />
@endsection
